phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
/**
 ****************************************************************************************
 *
 * @file DA7218_regs.h
 *
 * @brief DA7217/8 registers file
 *
 * Copyright (C) 2019 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 ****************************************************************************************
 */
#ifndef REGS_DA7218_H
#define REGS_DA7218_H

/****************************************************************************
* Module: memoryMap5
* Range.: 0x0..0x1, 0x2
****************************************************************************/

/****************************************************************************
* SYSTEM_ACTIVE_REG, SYSTEM_ACTIVE description
****************************************************************************/

#define SYSTEM_ACTIVE_REG_adr 0x0
#define SYSTEM_ACTIVE_REG_reset 0x00
#define SYSTEM_ACTIVE_REG_mask 0x01

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char SYSTEM_ACTIVE        : 1; // Bit 0
    unsigned char                      : 7; // Bit 7-1
  };
} SYSTEM_ACTIVE_REG_type ;

#define SYSTEM_ACTIVE_SYSTEM_ACTIVE        0x0001 // Bit 0

/****************************************************************************
* CIF_CTRL_REG, CIF_CTRL description
****************************************************************************/

#define CIF_CTRL_REG_adr 0x1
#define CIF_CTRL_REG_reset 0x00
#define CIF_CTRL_REG_mask 0x01

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char CIF_I2C_WRITE_MODE   : 1; // Bit 0
    unsigned char                      : 7; // Bit 7-1
  };
} CIF_CTRL_REG_type ;

#define CIF_CTRL_CIF_I2C_WRITE_MODE   0x0001 // Bit 0

/****************************************************************************
* Module: memoryMap6
* Range.: 0x4..0x10, 0xD
****************************************************************************/

/****************************************************************************
* CHIP_ID1_REG, CHIP_ID1 description
****************************************************************************/

#define DA7218CHIP_ID1_REG_adr 0x4
#define DA7218CHIP_ID1_REG_reset 0x23
#define DA7218CHIP_ID1_REG_mask 0xFF

/****************************************************************************
* CHIP_ID2_REG, CHIP_ID2 description
****************************************************************************/

#define DA7218CHIP_ID2_REG_adr 0x5
#define DA7218CHIP_ID2_REG_reset 0x39
#define DA7218CHIP_ID2_REG_mask 0xFF

/****************************************************************************
* SOFT_RESET_REG, SOFT_RESET description
****************************************************************************/

#define SOFT_RESET_REG_adr 0x9
#define SOFT_RESET_REG_reset 0x00
#define SOFT_RESET_REG_mask 0x80

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 7;
    unsigned char CIF_REG_SOFT_RESET   : 1; // Bit 7
  };
} SOFT_RESET_REG_type ;

#define SOFT_RESET_CIF_REG_SOFT_RESET   0x0080 // Bit 7

/****************************************************************************
* CHIP_REVISION_REG, CHIP_REVISION description
****************************************************************************/

#define DA7218CHIP_REVISION_REG_adr 0x6
#define DA7218CHIP_REVISION_REG_reset 0x01
#define DA7218CHIP_REVISION_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char CHIP_MINOR           : 4; // Bit 3-0
    unsigned char CHIP_MAJOR           : 4; // Bit 7-4
  };
} DA7218CHIP_REVISION_REG_type ;

#define DA7218CHIP_REVISION_CHIP_MINOR           0x000F // Bit 3-0
#define DA7218CHIP_REVISION_CHIP_MAJOR           0x00F0 // Bit 7-4

/****************************************************************************
* SR_REG, SR description
****************************************************************************/

#define SR_REG_adr 0xB
#define SR_REG_reset 0xAA
#define SR_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char SR_ADC               : 4; // Bit 3-0
    unsigned char SR_DAC               : 4; // Bit 7-4
  };
} SR_REG_type ;

#define SR_SR_ADC               0x000F // Bit 3-0
#define SR_SR_DAC               0x00F0 // Bit 7-4

/****************************************************************************
* PC_COUNT_REG, PC_COUNT description
****************************************************************************/

#define PC_COUNT_REG_adr 0xC
#define PC_COUNT_REG_reset 0x02
#define PC_COUNT_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char PC_FREERUN           : 1; // Bit 0
    unsigned char PC_RESYNC_AUTO       : 1; // Bit 1
    unsigned char                      : 6; // Bit 7-2
  };
} PC_COUNT_REG_type ;

#define PC_COUNT_PC_FREERUN           0x0001 // Bit 0
#define PC_COUNT_PC_RESYNC_AUTO       0x0002 // Bit 1

/****************************************************************************
* CIF_TIMEOUT_CTRL_REG, CIF_TIMEOUT_CTRL description
****************************************************************************/

#define CIF_TIMEOUT_CTRL_REG_adr 0x10
#define CIF_TIMEOUT_CTRL_REG_reset 0x01
#define CIF_TIMEOUT_CTRL_REG_mask 0x01

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char I2C_TIMEOUT_EN       : 1; // Bit 0
    unsigned char                      : 7; // Bit 7-1
  };
} CIF_TIMEOUT_CTRL_REG_type ;

#define CIF_TIMEOUT_CTRL_I2C_TIMEOUT_EN       0x0001 // Bit 0

/****************************************************************************
* GAIN_RAMP_CTRL_REG, GAIN_RAMP_CTRL description
****************************************************************************/

#define GAIN_RAMP_CTRL_REG_adr 0xD
#define GAIN_RAMP_CTRL_REG_reset 0x00
#define GAIN_RAMP_CTRL_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char GAIN_RAMP_RATE       : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} GAIN_RAMP_CTRL_REG_type ;

#define GAIN_RAMP_CTRL_GAIN_RAMP_RATE       0x0003 // Bit 1-0

/****************************************************************************
* Module: memoryMap31
* Range.: 0x14..0x16, 0x3
****************************************************************************/

/****************************************************************************
* SYSTEM_MODES_INPUT_REG, SYSTEM_MODES_INPUT description
****************************************************************************/

#define SYSTEM_MODES_INPUT_REG_adr 0x14
#define SYSTEM_MODES_INPUT_REG_reset 0x00
#define SYSTEM_MODES_INPUT_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MODE_SUBMIT          : 1; // Bit 0
    unsigned char ADC_MODE             : 7; // Bit 7-1
  };
} SYSTEM_MODES_INPUT_REG_type ;

#define SYSTEM_MODES_INPUT_MODE_SUBMIT          0x0001 // Bit 0
#define SYSTEM_MODES_INPUT_ADC_MODE             0x00FE // Bit 7-1

/****************************************************************************
* SYSTEM_MODES_OUTPUT_REG, SYSTEM_MODES_OUTPUT description
****************************************************************************/

#define SYSTEM_MODES_OUTPUT_REG_adr 0x15
#define SYSTEM_MODES_OUTPUT_REG_reset 0x00
#define SYSTEM_MODES_OUTPUT_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char FIELD1               : 1; // Bit 0
    unsigned char DAC_MODE             : 7; // Bit 7-1
  };
} SYSTEM_MODES_OUTPUT_REG_type ;

