phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define SYSTEM_MODES_OUTPUT_FIELD1               0x0001 // Bit 0
#define SYSTEM_MODES_OUTPUT_DAC_MODE             0x00FE // Bit 7-1

/****************************************************************************
* SYSTEM_STATUS_REG, SYSTEM_STATUS description
****************************************************************************/

#define SYSTEM_STATUS_REG_adr 0x16
#define SYSTEM_STATUS_REG_reset 0x00
#define SYSTEM_STATUS_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char SC1_BUSY             : 1; // Bit 0
    unsigned char SC2_BUSY             : 1; // Bit 1
    unsigned char                      : 6; // Bit 7-2
  };
} SYSTEM_STATUS_REG_type ;

#define SYSTEM_STATUS_SC1_BUSY             0x0001 // Bit 0
#define SYSTEM_STATUS_SC2_BUSY             0x0002 // Bit 1

/****************************************************************************
* Module: memoryMap16
* Range.: 0x18..0x1B, 0x4
****************************************************************************/

/****************************************************************************
* IN_1L_FILTER_CTRL_REG, IN_1L_FILTER_CTRL description
****************************************************************************/

#define IN_1L_FILTER_CTRL_REG_adr 0x18
#define IN_1L_FILTER_CTRL_REG_reset 0x00
#define IN_1L_FILTER_CTRL_REG_mask 0xE0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char         : 5;
    unsigned char IN_1L_RAMP_EN        : 1; // Bit 5
    unsigned char IN_1L_MUTE_EN        : 1; // Bit 6
    unsigned char IN_1L_FILTER_EN      : 1; // Bit 7
  };
} IN_1L_FILTER_CTRL_REG_type ;

#define IN_1L_FILTER_CTRL_IN_1L_RAMP_EN        0x0020 // Bit 5
#define IN_1L_FILTER_CTRL_IN_1L_MUTE_EN        0x0040 // Bit 6
#define IN_1L_FILTER_CTRL_IN_1L_FILTER_EN      0x0080 // Bit 7

/****************************************************************************
* IN_1R_FILTER_CTRL_REG, IN_1R_FILTER_CTRL description
****************************************************************************/

#define IN_1R_FILTER_CTRL_REG_adr 0x19
#define IN_1R_FILTER_CTRL_REG_reset 0x00
#define IN_1R_FILTER_CTRL_REG_mask 0xE0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char         : 5;
    unsigned char IN_1R_RAMP_EN        : 1; // Bit 5
    unsigned char IN_1R_MUTE_EN        : 1; // Bit 6
    unsigned char IN_1R_FILTER_EN      : 1; // Bit 7
  };
} IN_1R_FILTER_CTRL_REG_type ;

#define IN_1R_FILTER_CTRL_IN_1R_RAMP_EN        0x0020 // Bit 5
#define IN_1R_FILTER_CTRL_IN_1R_MUTE_EN        0x0040 // Bit 6
#define IN_1R_FILTER_CTRL_IN_1R_FILTER_EN      0x0080 // Bit 7

/****************************************************************************
* IN_2L_FILTER_CTRL_REG, IN_2L_FILTER_CTRL description
****************************************************************************/

#define IN_2L_FILTER_CTRL_REG_adr 0x1A
#define IN_2L_FILTER_CTRL_REG_reset 0x00
#define IN_2L_FILTER_CTRL_REG_mask 0xE0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 5;
    unsigned char IN_2L_RAMP_EN        : 1; // Bit 5
    unsigned char IN_2L_MUTE_EN        : 1; // Bit 6
    unsigned char IN_2L_FILTER_EN      : 1; // Bit 7
  };
} IN_2L_FILTER_CTRL_REG_type ;

#define IN_2L_FILTER_CTRL_IN_2L_RAMP_EN        0x0020 // Bit 5
#define IN_2L_FILTER_CTRL_IN_2L_MUTE_EN        0x0040 // Bit 6
#define IN_2L_FILTER_CTRL_IN_2L_FILTER_EN      0x0080 // Bit 7

/****************************************************************************
* IN_2R_FILTER_CTRL_REG, IN_2R_FILTER_CTRL description
****************************************************************************/

#define IN_2R_FILTER_CTRL_REG_adr 0x1B
#define IN_2R_FILTER_CTRL_REG_reset 0x00
#define IN_2R_FILTER_CTRL_REG_mask 0xE0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 5;
    unsigned char IN_2R_RAMP_EN        : 1; // Bit 5
    unsigned char IN_2R_MUTE_EN        : 1; // Bit 6
    unsigned char IN_2R_FILTER_EN      : 1; // Bit 7
  };
} IN_2R_FILTER_CTRL_REG_type ;

#define IN_2R_FILTER_CTRL_IN_2R_RAMP_EN        0x0020 // Bit 5
#define IN_2R_FILTER_CTRL_IN_2R_MUTE_EN        0x0040 // Bit 6
#define IN_2R_FILTER_CTRL_IN_2R_FILTER_EN      0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap26
* Range.: 0x20..0x21, 0x2
****************************************************************************/

/****************************************************************************
* OUT_1L_FILTER_CTRL_REG, DAC_L_CTRL description
****************************************************************************/

#define OUT_1L_FILTER_CTRL_REG_adr 0x20
#define OUT_1L_FILTER_CTRL_REG_reset 0x40
#define OUT_1L_FILTER_CTRL_REG_mask 0xF8

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 3;
    unsigned char OUT_1L_BIQ_5STAGE_SEL  : 1; // Bit 3
    unsigned char OUT_1L_SUBRANGE_EN   : 1; // Bit 4
    unsigned char OUT_1L_RAMP_EN       : 1; // Bit 5
    unsigned char OUT_1L_MUTE_EN       : 1; // Bit 6
    unsigned char OUT_1L_FILTER_EN     : 1; // Bit 7
  };
} OUT_1L_FILTER_CTRL_REG_type ;

#define OUT_1L_FILTER_CTRL_OUT_1L_BIQ_5STAGE_SEL  0x0008 // Bit 3
#define OUT_1L_FILTER_CTRL_OUT_1L_SUBRANGE_EN   0x0010 // Bit 4
#define OUT_1L_FILTER_CTRL_OUT_1L_RAMP_EN       0x0020 // Bit 5
#define OUT_1L_FILTER_CTRL_OUT_1L_MUTE_EN       0x0040 // Bit 6
#define OUT_1L_FILTER_CTRL_OUT_1L_FILTER_EN     0x0080 // Bit 7

/****************************************************************************
* OUT_1R_FILTER_CTRL_REG, DAC_R_CTRL description
****************************************************************************/

#define OUT_1R_FILTER_CTRL_REG_adr 0x21
#define OUT_1R_FILTER_CTRL_REG_reset 0x40
#define OUT_1R_FILTER_CTRL_REG_mask 0xF8

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 3;
    unsigned char OUT_1R_BIQ_5STAGE_SEL  : 1; // Bit 3
    unsigned char OUT_1R_SUBRANGE_EN   : 1; // Bit 4
    unsigned char OUT_1R_RAMP_EN       : 1; // Bit 5
    unsigned char OUT_1R_MUTE_EN       : 1; // Bit 6
    unsigned char OUT_1R_FILTER_EN     : 1; // Bit 7
  };
} OUT_1R_FILTER_CTRL_REG_type ;

