phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define OUT_1R_FILTER_CTRL_OUT_1R_BIQ_5STAGE_SEL  0x0008 // Bit 3
#define OUT_1R_FILTER_CTRL_OUT_1R_SUBRANGE_EN   0x0010 // Bit 4
#define OUT_1R_FILTER_CTRL_OUT_1R_RAMP_EN       0x0020 // Bit 5
#define OUT_1R_FILTER_CTRL_OUT_1R_MUTE_EN       0x0040 // Bit 6
#define OUT_1R_FILTER_CTRL_OUT_1R_FILTER_EN     0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap25
* Range.: 0x24..0x2A, 0x7
****************************************************************************/

/****************************************************************************
* OUT_1_HPF_FILTER_CTRL_REG, OUT_1_HPF_FILTER description
****************************************************************************/

#define OUT_1_HPF_FILTER_CTRL_REG_adr 0x24
#define OUT_1_HPF_FILTER_CTRL_REG_reset 0x80
#define OUT_1_HPF_FILTER_CTRL_REG_mask 0xBF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUT_VOICE_HPF_CORNER  : 3; // Bit 2-0
    unsigned char OUT_VOICE_EN          : 1; // Bit 3
    unsigned char OUT_AUDIO_HPF_CORNER  : 2; // Bit 5-4
    unsigned char _reserved_6_          : 1; // Bit 6
    unsigned char OUT_HPF_EN            : 1; // Bit 7
  };
} OUT_1_HPF_FILTER_CTRL_REG_type ;

#define OUT_1_HPF_FILTER_CTRL_OUT_1_VOICE_HPF_CORNER  0x0007 // Bit 2-0
#define OUT_1_HPF_FILTER_CTRL_OUT_1_VOICE_EN       0x0008 // Bit 3
#define OUT_1_HPF_FILTER_CTRL_OUT_1_AUDIO_HPF_CORNER  0x0030 // Bit 5-4
#define OUT_1_HPF_FILTER_CTRL__reserved_6_         0x0040 // Bit 6
#define OUT_1_HPF_FILTER_CTRL_OUT_1_HPF_EN         0x0080 // Bit 7

/****************************************************************************
* OUT_1_BIQ_5STAGE_CTRL_REG, OUT_1_BIQ_5STAGE_CTRL description
****************************************************************************/

#define OUT_1_BIQ_5STAGE_CTRL_REG_adr 0x28
#define OUT_1_BIQ_5STAGE_CTRL_REG_reset 0x40
#define OUT_1_BIQ_5STAGE_CTRL_REG_mask 0xC0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 6;
    unsigned char OUT_1_BIQ_5STAGE_MUTE_EN  : 1; // Bit 6
    unsigned char OUT_1_BIQ_5STAGE_FILTER_EN  : 1; // Bit 7
  };
} OUT_1_BIQ_5STAGE_CTRL_REG_type ;

#define OUT_1_BIQ_5STAGE_CTRL_OUT_1_BIQ_5STAGE_MUTE_EN  0x0040 // Bit 6
#define OUT_1_BIQ_5STAGE_CTRL_OUT_1_BIQ_5STAGE_FILTER_EN  0x0080 // Bit 7

/****************************************************************************
* OUT_1_EQ_12_FILTER_CTRL_REG, OUT_1_EQ_12_FILTER description
****************************************************************************/

#define OUT_1_EQ_12_FILTER_CTRL_REG_adr 0x25
#define OUT_1_EQ_12_FILTER_CTRL_REG_reset 0x77
#define OUT_1_EQ_12_FILTER_CTRL_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUT_1_EQ_BAND1       : 4; // Bit 3-0
    unsigned char OUT_1_EQ_BAND2       : 4; // Bit 7-4
  };
} OUT_1_EQ_12_FILTER_CTRL_REG_type ;

#define OUT_1_EQ_12_FILTER_CTRL_OUT_1_EQ_BAND1       0x000F // Bit 3-0
#define OUT_1_EQ_12_FILTER_CTRL_OUT_1_EQ_BAND2       0x00F0 // Bit 7-4

/****************************************************************************
* OUT_1_BIQ_5STAGE_DATA_REG, OUT_1_BIQ_5STAGE_DATA description
****************************************************************************/

#define OUT_1_BIQ_5STAGE_DATA_REG_adr 0x29
#define OUT_1_BIQ_5STAGE_DATA_REG_reset 0x00
#define OUT_1_BIQ_5STAGE_DATA_REG_mask 0xFF

/****************************************************************************
* OUT_1_EQ_34_FILTER_CTRL_REG, OUT_1_EQ_34_FILTER description
****************************************************************************/

#define OUT_1_EQ_34_FILTER_CTRL_REG_adr 0x26
#define OUT_1_EQ_34_FILTER_CTRL_REG_reset 0x77
#define OUT_1_EQ_34_FILTER_CTRL_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUT_1_EQ_BAND3       : 4; // Bit 3-0
    unsigned char OUT_1_EQ_BAND4       : 4; // Bit 7-4
  };
} OUT_1_EQ_34_FILTER_CTRL_REG_type ;

#define OUT_1_EQ_34_FILTER_CTRL_OUT_1_EQ_BAND3       0x000F // Bit 3-0
#define OUT_1_EQ_34_FILTER_CTRL_OUT_1_EQ_BAND4       0x00F0 // Bit 7-4

/****************************************************************************
* OUT_1_BIQ_5STAGE_ADDR_REG, OUT_1_BIQ_5STAGE_ADDR description
****************************************************************************/

#define OUT_1_BIQ_5STAGE_ADDR_REG_adr 0x2A
#define OUT_1_BIQ_5STAGE_ADDR_REG_reset 0x00
#define OUT_1_BIQ_5STAGE_ADDR_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUT_1_BIQ_5STAGE_ADDR  : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} OUT_1_BIQ_5STAGE_ADDR_REG_type ;

#define OUT_1_BIQ_5STAGE_ADDR_OUT_1_BIQ_5STAGE_ADDR  0x003F // Bit 5-0

/****************************************************************************
* OUT_1_EQ_5_FILTER_CTRL_REG, OUT_1_EQ_5_FILTER description
****************************************************************************/

#define OUT_1_EQ_5_FILTER_CTRL_REG_adr 0x27
#define OUT_1_EQ_5_FILTER_CTRL_REG_reset 0x07
#define OUT_1_EQ_5_FILTER_CTRL_REG_mask 0x8F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUT_1_EQ_BAND5       : 4; // Bit 3-0
    unsigned char _reserved_4_         : 3; // Bit 6-4
    unsigned char OUT_1_EQ_EN          : 1; // Bit 7
  };
} OUT_1_EQ_5_FILTER_CTRL_REG_type ;

#define OUT_1_EQ_5_FILTER_CTRL_OUT_1_EQ_BAND5       0x000F // Bit 3-0
#define OUT_1_EQ_5_FILTER_CTRL__reserved_4_         0x0070 // Bit 6-4
#define OUT_1_EQ_5_FILTER_CTRL_OUT_1_EQ_EN          0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap23
* Range.: 0x2C..0x2F, 0x4
****************************************************************************/

/****************************************************************************
* MIXIN_1_CTRL_REG, MIXIN_1_CTRL description
****************************************************************************/

#define MIXIN_1_CTRL_REG_adr 0x2C
#define MIXIN_1_CTRL_REG_reset 0x48
#define MIXIN_1_CTRL_REG_mask 0xFB

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIXIN_AMP_BIAS       : 2; // Bit 1-0
    unsigned char _reserved_2_         : 1; // Bit 2
    unsigned char MIXIN_1_MIX_SEL      : 1; // Bit 3
    unsigned char MIXIN_1_AMP_ZC_EN    : 1; // Bit 4
    unsigned char MIXIN_1_AMP_RAMP_EN  : 1; // Bit 5
    unsigned char MIXIN_1_AMP_MUTE_EN  : 1; // Bit 6
    unsigned char MIXIN_1_AMP_EN       : 1; // Bit 7
  };
} MIXIN_1_CTRL_REG_type ;

#define MIXIN_1_CTRL_MIXIN_AMP_BIAS       0x0003 // Bit 1-0
#define MIXIN_1_CTRL__reserved_2_         0x0004 // Bit 2
#define MIXIN_1_CTRL_MIXIN_1_MIX_SEL      0x0008 // Bit 3
#define MIXIN_1_CTRL_MIXIN_1_AMP_ZC_EN    0x0010 // Bit 4
#define MIXIN_1_CTRL_MIXIN_1_AMP_RAMP_EN  0x0020 // Bit 5
#define MIXIN_1_CTRL_MIXIN_1_AMP_MUTE_EN  0x0040 // Bit 6
#define MIXIN_1_CTRL_MIXIN_1_AMP_EN       0x0080 // Bit 7

/****************************************************************************
* MIXIN_1_GAIN_REG, MIXIN_1_GAIN description
****************************************************************************/

