phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define MIXIN_1_GAIN_REG_adr 0x2D
#define MIXIN_1_GAIN_REG_reset 0x03
#define MIXIN_1_GAIN_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIXIN_1_AMP_GAIN     : 4; // Bit 3-0
    unsigned char                      : 4; // Bit 7-4
  };
} MIXIN_1_GAIN_REG_type ;

#define MIXIN_1_GAIN_MIXIN_1_AMP_GAIN     0x000F // Bit 3-0

/****************************************************************************
* MIXIN_2_CTRL_REG, MIXIN_2_CTRL description
****************************************************************************/

#define MIXIN_2_CTRL_REG_adr 0x2E
#define MIXIN_2_CTRL_REG_reset 0x48
#define MIXIN_2_CTRL_REG_mask 0xF8

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 3;
    unsigned char MIXIN_2_MIX_SEL      : 1; // Bit 3
    unsigned char MIXIN_2_AMP_ZC_EN    : 1; // Bit 4
    unsigned char MIXIN_2_AMP_RAMP_EN  : 1; // Bit 5
    unsigned char MIXIN_2_AMP_MUTE_EN  : 1; // Bit 6
    unsigned char MIXIN_2_AMP_EN       : 1; // Bit 7
  };
} MIXIN_2_CTRL_REG_type ;

#define MIXIN_2_CTRL_MIXIN_2_MIX_SEL      0x0008 // Bit 3
#define MIXIN_2_CTRL_MIXIN_2_AMP_ZC_EN    0x0010 // Bit 4
#define MIXIN_2_CTRL_MIXIN_2_AMP_RAMP_EN  0x0020 // Bit 5
#define MIXIN_2_CTRL_MIXIN_2_AMP_MUTE_EN  0x0040 // Bit 6
#define MIXIN_2_CTRL_MIXIN_2_AMP_EN       0x0080 // Bit 7

/****************************************************************************
* MIXIN_2_GAIN_REG, MIXIN_2_GAIN description
****************************************************************************/

#define MIXIN_2_GAIN_REG_adr 0x2F
#define MIXIN_2_GAIN_REG_reset 0x03
#define MIXIN_2_GAIN_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIXIN_2_AMP_GAIN     : 4; // Bit 3-0
    unsigned char                      : 4; // Bit 7-4
  };
} MIXIN_2_GAIN_REG_type ;

#define MIXIN_2_GAIN_MIXIN_2_AMP_GAIN     0x000F // Bit 3-0

/****************************************************************************
* Module: memoryMap2
* Range.: 0x30..0x38, 0x9
****************************************************************************/

/****************************************************************************
* ALC_CTRL1_REG, ALC_CTRL1 description
****************************************************************************/

#define ALC_CTRL1_REG_adr 0x30
#define ALC_CTRL1_REG_reset 0x00
#define ALC_CTRL1_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_EN               : 4; // Bit 3-0
    unsigned char ALC_SYNC_MODE        : 4; // Bit 7-4
  };
} ALC_CTRL1_REG_type ;

#define ALC_CTRL1_ALC_EN               0x000F // Bit 3-0
#define ALC_CTRL1_ALC_SYNC_MODE        0x00F0 // Bit 7-4

/****************************************************************************
* ALC_CTRL2_REG, ALC_CTRL2 description
****************************************************************************/

#define ALC_CTRL2_REG_adr 0x31
#define ALC_CTRL2_REG_reset 0x00
#define ALC_CTRL2_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_ATTACK           : 4; // Bit 3-0
    unsigned char ALC_RELEASE          : 4; // Bit 7-4
  };
} ALC_CTRL2_REG_type ;

#define ALC_CTRL2_ALC_ATTACK           0x000F // Bit 3-0
#define ALC_CTRL2_ALC_RELEASE          0x00F0 // Bit 7-4

/****************************************************************************
* ALC_CTRL3_REG, ALC_CTRL3 description
****************************************************************************/

#define ALC_CTRL3_REG_adr 0x32
#define ALC_CTRL3_REG_reset 0x00
#define ALC_CTRL3_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_HOLD             : 4; // Bit 3-0
    unsigned char                      : 4; // Bit 7-4
  };
} ALC_CTRL3_REG_type ;

#define ALC_CTRL3_ALC_HOLD             0x000F // Bit 3-0

/****************************************************************************
* ALC_NOISE_REG, ALC_NOISE description
****************************************************************************/

#define ALC_NOISE_REG_adr 0x33
#define ALC_NOISE_REG_reset 0x3F
#define ALC_NOISE_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_NOISE            : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} ALC_NOISE_REG_type ;

#define ALC_NOISE_ALC_NOISE            0x003F // Bit 5-0

/****************************************************************************
* ALC_TARGET_MIN_REG, ALC_TARGET_MIN description
****************************************************************************/

#define ALC_TARGET_MIN_REG_adr 0x34
#define ALC_TARGET_MIN_REG_reset 0x3F
#define ALC_TARGET_MIN_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_THRESHOLD_MIN    : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} ALC_TARGET_MIN_REG_type ;

#define ALC_TARGET_MIN_ALC_THRESHOLD_MIN    0x003F // Bit 5-0

/****************************************************************************
* ALC_TARGET_MAX_REG, ALC_TARGET_MAX description
****************************************************************************/

#define ALC_TARGET_MAX_REG_adr 0x35
#define ALC_TARGET_MAX_REG_reset 0x00
#define ALC_TARGET_MAX_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_THRESHOLD_MAX    : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} ALC_TARGET_MAX_REG_type ;

#define ALC_TARGET_MAX_ALC_THRESHOLD_MAX    0x003F // Bit 5-0

/****************************************************************************
* ALC_GAIN_LIMITS_REG, ALC_GAIN_LIMITS description
****************************************************************************/

#define ALC_GAIN_LIMITS_REG_adr 0x36
#define ALC_GAIN_LIMITS_REG_reset 0xFF
#define ALC_GAIN_LIMITS_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_ATTEN_MAX        : 4; // Bit 3-0
    unsigned char ALC_GAIN_MAX         : 4; // Bit 7-4
  };
} ALC_GAIN_LIMITS_REG_type ;

#define ALC_GAIN_LIMITS_ALC_ATTEN_MAX        0x000F // Bit 3-0
#define ALC_GAIN_LIMITS_ALC_GAIN_MAX         0x00F0 // Bit 7-4

/****************************************************************************
* ALC_ANA_GAIN_LIMITS_REG, ALC_ANA_GAIN_LIMITS description
****************************************************************************/

