phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define ALC_ANA_GAIN_LIMITS_REG_adr 0x37
#define ALC_ANA_GAIN_LIMITS_REG_reset 0x71
#define ALC_ANA_GAIN_LIMITS_REG_mask 0x77

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_ANA_GAIN_MIN     : 3; // Bit 2-0
    unsigned char _reserved_3_         : 1; // Bit 3
    unsigned char ALC_ANA_GAIN_MAX     : 3; // Bit 6-4
    unsigned char                      : 1; // Bit 7
  };
} ALC_ANA_GAIN_LIMITS_REG_type ;

#define ALC_ANA_GAIN_LIMITS_ALC_ANA_GAIN_MIN     0x0007 // Bit 2-0
#define ALC_ANA_GAIN_LIMITS__reserved_3_         0x0008 // Bit 3
#define ALC_ANA_GAIN_LIMITS_ALC_ANA_GAIN_MAX     0x0070 // Bit 6-4

/****************************************************************************
* ALC_ANTICLIP_CTRL_REG, ALC_ANTICLIP_CTRL description
****************************************************************************/

#define ALC_ANTICLIP_CTRL_REG_adr 0x38
#define ALC_ANTICLIP_CTRL_REG_reset 0x00
#define ALC_ANTICLIP_CTRL_REG_mask 0x83

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ALC_ANTICLIP_STEP    : 2; // Bit 1-0
    unsigned char _reserved_2_         : 5; // Bit 6-2
    unsigned char ALC_ANTICLIP_EN      : 1; // Bit 7
  };
} ALC_ANTICLIP_CTRL_REG_type ;

#define ALC_ANTICLIP_CTRL_ALC_ANTICLIP_STEP    0x0003 // Bit 1-0
#define ALC_ANTICLIP_CTRL__reserved_2_         0x007C // Bit 6-2
#define ALC_ANTICLIP_CTRL_ALC_ANTICLIP_EN      0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap1
* Range.: 0x3C..0x40, 0x5
****************************************************************************/

/****************************************************************************
* AGS_ENABLE_REG, AGS_ENABLE description
****************************************************************************/

#define AGS_ENABLE_REG_adr 0x3C
#define AGS_ENABLE_REG_reset 0x00
#define AGS_ENABLE_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char AGS_ENABLE           : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} AGS_ENABLE_REG_type ;

#define AGS_ENABLE_AGS_ENABLE           0x0003 // Bit 1-0

/****************************************************************************
* AGS_ANTICLIP_CTRL_REG, AGS_ANTICLIP_CTRL description
****************************************************************************/

#define AGS_ANTICLIP_CTRL_REG_adr 0x40
#define AGS_ANTICLIP_CTRL_REG_reset 0x00
#define AGS_ANTICLIP_CTRL_REG_mask 0x80

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 7;
    unsigned char AGS_ANTICLIP_EN      : 1; // Bit 7
  };
} AGS_ANTICLIP_CTRL_REG_type ;

#define AGS_ANTICLIP_CTRL_AGS_ANTICLIP_EN      0x0080 // Bit 7

/****************************************************************************
* AGS_TRIGGER_REG, AGS_TRIGGER description
****************************************************************************/

#define AGS_TRIGGER_REG_adr 0x3D
#define AGS_TRIGGER_REG_reset 0x09
#define AGS_TRIGGER_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char AGS_TRIGGER          : 4; // Bit 3-0
    unsigned char                      : 4; // Bit 7-4
  };
} AGS_TRIGGER_REG_type ;

#define AGS_TRIGGER_AGS_TRIGGER          0x000F // Bit 3-0

/****************************************************************************
* AGS_ATT_MAX_REG, AGS_ATT_MAX description
****************************************************************************/

#define AGS_ATT_MAX_REG_adr 0x3E
#define AGS_ATT_MAX_REG_reset 0x00
#define AGS_ATT_MAX_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char AGS_ATT_MAX          : 3; // Bit 2-0
    unsigned char                      : 5; // Bit 7-3
  };
} AGS_ATT_MAX_REG_type ;

#define AGS_ATT_MAX_AGS_ATT_MAX          0x0007 // Bit 2-0

/****************************************************************************
* AGS_TIMEOUT_REG, AGS_TIMEOUT description
****************************************************************************/

#define AGS_TIMEOUT_REG_adr 0x3F
#define AGS_TIMEOUT_REG_reset 0x00
#define AGS_TIMEOUT_REG_mask 0x01

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char AGS_TIMEOUT_EN       : 1; // Bit 0
    unsigned char                      : 7; // Bit 7-1
  };
} AGS_TIMEOUT_REG_type ;

#define AGS_TIMEOUT_AGS_TIMEOUT_EN       0x0001 // Bit 0

/****************************************************************************
* Module: memoryMap3
* Range.: 0x44..0x48, 0x5
****************************************************************************/

/****************************************************************************
* CALIB_CTRL_REG, CALIB_CTRL description
****************************************************************************/

#define CALIB_CTRL_REG_adr 0x44
#define CALIB_CTRL_REG_reset 0x00
#define CALIB_CTRL_REG_mask 0x0D

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char CALIB_OFFSET_EN      : 1; // Bit 0
    unsigned char _reserved_1_         : 1; // Bit 1
    unsigned char CALIB_AUTO_EN        : 1; // Bit 2
    unsigned char CALIB_OVERFLOW       : 1; // Bit 3
    unsigned char                      : 4; // Bit 7-4
  };
} CALIB_CTRL_REG_type ;

#define CALIB_CTRL_CALIB_OFFSET_EN      0x0001 // Bit 0
#define CALIB_CTRL__reserved_1_         0x0002 // Bit 1
#define CALIB_CTRL_CALIB_AUTO_EN        0x0004 // Bit 2
#define CALIB_CTRL_CALIB_OVERFLOW       0x0008 // Bit 3

/****************************************************************************
* CALIB_OFFSET_AUTO_U_2_REG, ALC_OFFSET_AUTO_U_R description
****************************************************************************/

#define CALIB_OFFSET_AUTO_U_2_REG_adr 0x48
#define CALIB_OFFSET_AUTO_U_2_REG_reset 0x00
#define CALIB_OFFSET_AUTO_U_2_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char CALIB_OFFSET_AUTO_U_2  : 4; // Bit 3-0
    unsigned char                      : 4; // Bit 7-4
  };
} CALIB_OFFSET_AUTO_U_2_REG_type ;

