phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define CALIB_OFFSET_AUTO_U_2_CALIB_OFFSET_AUTO_U_2  0x000F // Bit 3-0

/****************************************************************************
* CALIB_OFFSET_AUTO_M_1_REG, ALC_OFFSET_AUTO_M_L description
****************************************************************************/

#define CALIB_OFFSET_AUTO_M_1_REG_adr 0x45
#define CALIB_OFFSET_AUTO_M_1_REG_reset 0x00
#define CALIB_OFFSET_AUTO_M_1_REG_mask 0xFF

/****************************************************************************
* CALIB_OFFSET_AUTO_U_1_REG, ALC_OFFSET_AUTO_U_L description
****************************************************************************/

#define CALIB_OFFSET_AUTO_U_1_REG_adr 0x46
#define CALIB_OFFSET_AUTO_U_1_REG_reset 0x00
#define CALIB_OFFSET_AUTO_U_1_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char CALIB_OFFSET_AUTO_U_1  : 4; // Bit 3-0
    unsigned char                      : 4; // Bit 7-4
  };
} CALIB_OFFSET_AUTO_U_1_REG_type ;

#define CALIB_OFFSET_AUTO_U_1_CALIB_OFFSET_AUTO_U_1  0x000F // Bit 3-0

/****************************************************************************
* CALIB_OFFSET_AUTO_M_2_REG, ALC_OFFSET_AUTO_M_R description
****************************************************************************/

#define CALIB_OFFSET_AUTO_M_2_REG_adr 0x47
#define CALIB_OFFSET_AUTO_M_2_REG_reset 0x00
#define CALIB_OFFSET_AUTO_M_2_REG_mask 0xFF

/****************************************************************************
* Module: memoryMap13
* Range.: 0x4C..0x4C, 0x1
****************************************************************************/

/****************************************************************************
* ENV_TRACK_CTRL_REG, ENV_TRACK_CTRL description
****************************************************************************/

#define ENV_TRACK_CTRL_REG_adr 0x4C
#define ENV_TRACK_CTRL_REG_reset 0x00
#define ENV_TRACK_CTRL_REG_mask 0x33

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char INTEG_ATTACK         : 2; // Bit 1-0
    unsigned char _reserved_2_         : 2; // Bit 3-2
    unsigned char INTEG_RELEASE        : 2; // Bit 5-4
    unsigned char                      : 2; // Bit 7-6
  };
} ENV_TRACK_CTRL_REG_type ;

#define ENV_TRACK_CTRL_INTEG_ATTACK         0x0003 // Bit 1-0
#define ENV_TRACK_CTRL__reserved_2_         0x000C // Bit 3-2
#define ENV_TRACK_CTRL_INTEG_RELEASE        0x0030 // Bit 5-4

/****************************************************************************
* Module: memoryMap20
* Range.: 0x50..0x51, 0x2
****************************************************************************/

/****************************************************************************
* LVL_DET_CTRL_REG, LVL_DET_CTRL description
****************************************************************************/

#define LVL_DET_CTRL_REG_adr 0x50
#define LVL_DET_CTRL_REG_reset 0x00
#define LVL_DET_CTRL_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char LVL_DET_EN           : 4; // Bit 3-0
    unsigned char                      : 4; // Bit 7-4
  };
} LVL_DET_CTRL_REG_type ;

#define LVL_DET_CTRL_LVL_DET_EN           0x000F // Bit 3-0

/****************************************************************************
* LVL_DET_LEVEL_REG, LVL_DET_LEVEL description
****************************************************************************/

#define LVL_DET_LEVEL_REG_adr 0x51
#define LVL_DET_LEVEL_REG_reset 0x7F
#define LVL_DET_LEVEL_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char LVL_DET_LEVEL        : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} LVL_DET_LEVEL_REG_type ;

#define LVL_DET_LEVEL_LVL_DET_LEVEL        0x007F // Bit 6-0

/****************************************************************************
* Module: memoryMap10
* Range.: 0x54..0x5B, 0x8
****************************************************************************/

/****************************************************************************
* DGS_TRIGGER_REG, DGS_TRIGGER description
****************************************************************************/

#define DGS_TRIGGER_REG_adr 0x54
#define DGS_TRIGGER_REG_reset 0x24
#define DGS_TRIGGER_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DGS_TRIGGER_LVL      : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} DGS_TRIGGER_REG_type ;

#define DGS_TRIGGER_DGS_TRIGGER_LVL      0x003F // Bit 5-0

/****************************************************************************
* DGS_SYNC_DELAY2_REG,
****************************************************************************/

#define DGS_SYNC_DELAY2_REG_adr 0x58
#define DGS_SYNC_DELAY2_REG_reset 0x31
#define DGS_SYNC_DELAY2_REG_mask 0xFF

/****************************************************************************
* DGS_ENABLE_REG, DGS_ENABLE description
****************************************************************************/

#define DGS_ENABLE_REG_adr 0x55
#define DGS_ENABLE_REG_reset 0x00
#define DGS_ENABLE_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DGS_ENABLE           : 2; // Bit 1-0
    unsigned char DGS_DTM_CFG          : 3; // Bit 4-2
    unsigned char                      : 3; // Bit 7-5
  };
} DGS_ENABLE_REG_type ;

#define DGS_ENABLE_DGS_ENABLE           0x0003 // Bit 1-0
#define DGS_ENABLE_DGS_DTM_CFG          0x001C // Bit 4-2

/****************************************************************************
* DGS_SYNC_DELAY3_REG,
****************************************************************************/

#define DGS_SYNC_DELAY3_REG_adr 0x59
#define DGS_SYNC_DELAY3_REG_reset 0x11
#define DGS_SYNC_DELAY3_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DGS_SYNC_DELAY3      : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} DGS_SYNC_DELAY3_REG_type ;

#define DGS_SYNC_DELAY3_DGS_SYNC_DELAY3      0x007F // Bit 6-0

/****************************************************************************
* DGS_RISE_FALL_REG, DGS_RISE_FALL description
****************************************************************************/

#define DGS_RISE_FALL_REG_adr 0x56
#define DGS_RISE_FALL_REG_reset 0x50
#define DGS_RISE_FALL_REG_mask 0x77

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DGS_RISE_COEFF       : 3; // Bit 2-0
    unsigned char _reserved_3_         : 1; // Bit 3
    unsigned char DGS_FALL_COEFF       : 3; // Bit 6-4
    unsigned char                      : 1; // Bit 7
  };
} DGS_RISE_FALL_REG_type ;

#define DGS_RISE_FALL_DGS_RISE_COEFF       0x0007 // Bit 2-0
#define DGS_RISE_FALL__reserved_3_         0x0008 // Bit 3
#define DGS_RISE_FALL_DGS_FALL_COEFF       0x0070 // Bit 6-4

/****************************************************************************
* DGS_LEVELS_REG, DGS_ANTICLIP_LVL description
****************************************************************************/

#define DGS_LEVELS_REG_adr 0x5A
#define DGS_LEVELS_REG_reset 0x01
#define DGS_LEVELS_REG_mask 0xF7

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DGS_ANTICLIP_LVL     : 3; // Bit 2-0
    unsigned char _reserved_3_         : 1; // Bit 3
    unsigned char DGS_SIGNAL_LVL       : 4; // Bit 7-4
  };
} DGS_LEVELS_REG_type ;

#define DGS_LEVELS_DGS_ANTICLIP_LVL     0x0007 // Bit 2-0
#define DGS_LEVELS__reserved_3_         0x0008 // Bit 3
#define DGS_LEVELS_DGS_SIGNAL_LVL       0x00F0 // Bit 7-4

/****************************************************************************
* DGS_SYNC_DELAY_REG, DGS_SYNC_DELAY description
****************************************************************************/

#define DGS_SYNC_DELAY_REG_adr 0x57
#define DGS_SYNC_DELAY_REG_reset 0xA3
#define DGS_SYNC_DELAY_REG_mask 0xFF

/****************************************************************************
* DGS_GAIN_CTRL_REG, DGS_GAIN_CTRL description
****************************************************************************/

