phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DGS_GAIN_CTRL_REG_adr 0x5B
#define DGS_GAIN_CTRL_REG_reset 0x74
#define DGS_GAIN_CTRL_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DGS_STEPS            : 5; // Bit 4-0
    unsigned char DGS_RAMP_EN          : 1; // Bit 5
    unsigned char DGS_SUBR_EN          : 1; // Bit 6
    unsigned char                      : 1; // Bit 7
  };
} DGS_GAIN_CTRL_REG_type ;

#define DGS_GAIN_CTRL_DGS_STEPS            0x001F // Bit 4-0
#define DGS_GAIN_CTRL_DGS_RAMP_EN          0x0020 // Bit 5
#define DGS_GAIN_CTRL_DGS_SUBR_EN          0x0040 // Bit 6

/****************************************************************************
* Module: memoryMap29
* Range.: 0x5C..0x8B, 0x30
****************************************************************************/

/****************************************************************************
* DROUTING_OUTDAI_1L_REG, DROUTING_OUTDAI_1L description
****************************************************************************/

#define DROUTING_OUTDAI_1L_REG_adr 0x5C
#define DROUTING_OUTDAI_1L_REG_reset 0x01
#define DROUTING_OUTDAI_1L_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char InFilt1LEn           : 1; //bit 0 = Input filter 1 left
    unsigned char InFilt1REn           : 1; //bit 1 = Input filter 1 right
    unsigned char InFilt2LEn           : 1; //bit 2 = Input filter 2 left
    unsigned char InFilt2REn           : 1; //bit 3 = Input filter 2 right
    unsigned char ToneGen              : 1; //bit 4 = Tone generator
    unsigned char DaiLeft              : 1; //bit 5 = DAI 1 input left data
    unsigned char DaiRight             : 1; //bit 6 = DAI 1 input right data
    unsigned char                      : 1; // Bit 7
  };
} DROUTING_OUTDAI_1L_REG_type ;

#define DROUTING_OUTDAI_1L_OUTDAI_1L_SRC        0x007F // Bit 6-0

/****************************************************************************
* DMIX_OUTDAI_1L_INFILT_2R_GAIN_REG, DMIX_OUTDAI_1L_INFILT_2R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1L_INFILT_2R_GAIN_REG_adr 0x60
#define DMIX_OUTDAI_1L_INFILT_2R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1L_INFILT_2R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1L_INFILT_2R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1L_INFILT_2R_GAIN_REG_type ;

#define DMIX_OUTDAI_1L_INFILT_2R_GAIN_OUTDAI_1L_INFILT_2R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DROUTING_OUTDAI_1R_REG, DROUTING_OUTDAI_1R description
****************************************************************************/

#define DROUTING_OUTDAI_1R_REG_adr 0x64
#define DROUTING_OUTDAI_1R_REG_reset 0x04
#define DROUTING_OUTDAI_1R_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char InFilt1LEn           : 1; //bit 0 = Input filter 1 left
    unsigned char InFilt1REn           : 1; //bit 1 = Input filter 1 right
    unsigned char InFilt2LEn           : 1; //bit 2 = Input filter 2 left
    unsigned char InFilt2REn           : 1; //bit 3 = Input filter 2 right
    unsigned char ToneGen              : 1; //bit 4 = Tone generator
    unsigned char DaiLeft              : 1; //bit 5 = DAI 1 input left data
    unsigned char DaiRight             : 1; //bit 6 = DAI 1 input right data
    unsigned char                      : 1; // Bit 7
  };
} DROUTING_OUTDAI_1R_REG_type ;

#define DROUTING_OUTDAI_1R_OUTDAI_1R_SRC        0x007F // Bit 6-0

/****************************************************************************
* DMIX_OUTDAI_1R_INFILT_2R_GAIN_REG, DMIX_OUTDAI_1R_INFILT_2R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1R_INFILT_2R_GAIN_REG_adr 0x68
#define DMIX_OUTDAI_1R_INFILT_2R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1R_INFILT_2R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1R_INFILT_2R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1R_INFILT_2R_GAIN_REG_type ;

#define DMIX_OUTDAI_1R_INFILT_2R_GAIN_OUTDAI_1R_INFILT_2R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DROUTING_OUTFILT_1L_REG, DROUTING_OUTFILT_1L description
****************************************************************************/

#define DROUTING_OUTFILT_1L_REG_adr 0x6C
#define DROUTING_OUTFILT_1L_REG_reset 0x01
#define DROUTING_OUTFILT_1L_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char InFilt1LEn           : 1; //bit 0 = Input filter 1 left
    unsigned char InFilt1REn           : 1; //bit 1 = Input filter 1 right
    unsigned char InFilt2LEn           : 1; //bit 2 = Input filter 2 left
    unsigned char InFilt2REn           : 1; //bit 3 = Input filter 2 right
    unsigned char ToneGen              : 1; //bit 4 = Tone generator
    unsigned char DaiLeft              : 1; //bit 5 = DAI 1 input left data
    unsigned char DaiRight             : 1; //bit 6 = DAI 1 input right data
    unsigned char                      : 1; // Bit 7
  };
} DROUTING_OUTFILT_1L_REG_type ;

#define DROUTING_OUTFILT_1L_OUTFILT_1L_SRC       0x007F // Bit 6-0

/****************************************************************************
* DMIX_OUTFILT_1L_INFILT_2R_GAIN_REG, DMIX_OUTFILT_1L_INFILT_2R_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1L_INFILT_2R_GAIN_REG_adr 0x70
#define DMIX_OUTFILT_1L_INFILT_2R_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1L_INFILT_2R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1L_INFILT_2R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1L_INFILT_2R_GAIN_REG_type ;

#define DMIX_OUTFILT_1L_INFILT_2R_GAIN_OUTFILT_1L_INFILT_2R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DROUTING_OUTFILT_1R_REG, DROUTING_OUTFILT_1R description
****************************************************************************/

#define DROUTING_OUTFILT_1R_REG_adr 0x74
#define DROUTING_OUTFILT_1R_REG_reset 0x04
#define DROUTING_OUTFILT_1R_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char InFilt1LEn           : 1;//bit 0 = Input filter 1 left
    unsigned char InFilt1REn           : 1;//bit 1 = Input filter 1 right
    unsigned char InFilt2LEn           : 1;//bit 2 = Input filter 2 left
    unsigned char InFilt2REn           : 1;//bit 3 = Input filter 2 right
    unsigned char ToneGen              : 1;//bit 4 = Tone generator
    unsigned char DaiLeft              : 1;//bit 5 = DAI 1 input left data
    unsigned char DaiRight             : 1;//bit 6 = DAI 1 input right data
    unsigned char                      : 1; // Bit 7
  };

} DROUTING_OUTFILT_1R_REG_type ;

