phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DROUTING_OUTFILT_1R_OUTFILT_1R_SRC       0x007F // Bit 6-0

/****************************************************************************
* DMIX_OUTFILT_1R_INFILT_2R_GAIN_REG, DMIX_OUTFILT_1R_INFILT_2R_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1R_INFILT_2R_GAIN_REG_adr 0x78
#define DMIX_OUTFILT_1R_INFILT_2R_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1R_INFILT_2R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1R_INFILT_2R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1R_INFILT_2R_GAIN_REG_type ;

#define DMIX_OUTFILT_1R_INFILT_2R_GAIN_OUTFILT_1R_INFILT_2R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1L_INFILT_1L_GAIN_REG, DMIX_OUTFILT_1L_INFILT_1L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1L_INFILT_1L_GAIN_REG_adr 0x5D
#define DMIX_OUTDAI_1L_INFILT_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1L_INFILT_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1L_INFILT_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1L_INFILT_1L_GAIN_REG_type ;

#define DMIX_OUTDAI_1L_INFILT_1L_GAIN_OUTDAI_1L_INFILT_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1L_TONEGEN_GAIN_REG, DMIX_OUTDAI_1L_TONEGEN_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1L_TONEGEN_GAIN_REG_adr 0x61
#define DMIX_OUTDAI_1L_TONEGEN_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1L_TONEGEN_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1L_TONEGEN_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1L_TONEGEN_GAIN_REG_type ;

#define DMIX_OUTDAI_1L_TONEGEN_GAIN_OUTDAI_1L_TONEGEN_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1R_INFILT_1L_GAIN_REG, DMIX_OUTDAI_1R_INFILT_1L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1R_INFILT_1L_GAIN_REG_adr 0x65
#define DMIX_OUTDAI_1R_INFILT_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1R_INFILT_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1R_INFILT_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1R_INFILT_1L_GAIN_REG_type ;

#define DMIX_OUTDAI_1R_INFILT_1L_GAIN_OUTDAI_1R_INFILT_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1R_TONEGEN_GAIN_REG, DMIX_OUTDAI_1R_TONEGEN_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1R_TONEGEN_GAIN_REG_adr 0x69
#define DMIX_OUTDAI_1R_TONEGEN_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1R_TONEGEN_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1R_TONEGEN_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1R_TONEGEN_GAIN_REG_type ;

#define DMIX_OUTDAI_1R_TONEGEN_GAIN_OUTDAI_1R_TONEGEN_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1L_INFILT_1L_GAIN_REG, DMIX_OUTFILT_1L_INFILT_1L_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1L_INFILT_1L_GAIN_REG_adr 0x6D
#define DMIX_OUTFILT_1L_INFILT_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1L_INFILT_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1L_INFILT_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1L_INFILT_1L_GAIN_REG_type ;

#define DMIX_OUTFILT_1L_INFILT_1L_GAIN_OUTFILT_1L_INFILT_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1L_TONEGEN_GAIN_REG, DMIX_OUTFILT_1L_TONEGEN_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1L_TONEGEN_GAIN_REG_adr 0x71
#define DMIX_OUTFILT_1L_TONEGEN_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1L_TONEGEN_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1L_TONEGEN_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1L_TONEGEN_GAIN_REG_type ;

#define DMIX_OUTFILT_1L_TONEGEN_GAIN_OUTFILT_1L_TONEGEN_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1R_INFILT_1L_GAIN_REG, DMIX_OUTFILT_1R_INFILT_1L_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1R_INFILT_1L_GAIN_REG_adr 0x75
#define DMIX_OUTFILT_1R_INFILT_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1R_INFILT_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1R_INFILT_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1R_INFILT_1L_GAIN_REG_type ;

#define DMIX_OUTFILT_1R_INFILT_1L_GAIN_OUTFILT_1R_INFILT_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1R_TONEGEN_GAIN_REG, DMIX_DAC_R_TONEGEN_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1R_TONEGEN_GAIN_REG_adr 0x79
#define DMIX_OUTFILT_1R_TONEGEN_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1R_TONEGEN_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1R_TONEGEN_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1R_TONEGEN_GAIN_REG_type ;

#define DMIX_OUTFILT_1R_TONEGEN_GAIN_OUTFILT_1R_TONEGEN_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1L_INFILT_1R_GAIN_REG, DMIX_OUTDAI_1L_INFILT_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1L_INFILT_1R_GAIN_REG_adr 0x5E
#define DMIX_OUTDAI_1L_INFILT_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1L_INFILT_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1L_INFILT_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1L_INFILT_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_1L_INFILT_1R_GAIN_OUTDAI_1L_INFILT_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1L_INDAI_1L_GAIN_REG, DMIX_OUTDAI_1L_INDAI_1L_GAIN description
****************************************************************************/

