phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DMIX_OUTDAI_1L_INDAI_1L_GAIN_REG_adr 0x62
#define DMIX_OUTDAI_1L_INDAI_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1L_INDAI_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1L_INDAI_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1L_INDAI_1L_GAIN_REG_type ;

#define DMIX_OUTDAI_1L_INDAI_1L_GAIN_OUTDAI_1L_INDAI_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1R_INFILT_1R_GAIN_REG, DMIX_OUTDAI_1R_INFILT_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1R_INFILT_1R_GAIN_REG_adr 0x66
#define DMIX_OUTDAI_1R_INFILT_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1R_INFILT_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1R_INFILT_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1R_INFILT_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_1R_INFILT_1R_GAIN_OUTDAI_1R_INFILT_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1R_INDAI_1L_GAIN_REG, DMIX_OUTDAI_1R_INDAI_1L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1R_INDAI_1L_GAIN_REG_adr 0x6A
#define DMIX_OUTDAI_1R_INDAI_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1R_INDAI_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1R_INDAI_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1R_INDAI_1L_GAIN_REG_type ;

#define DMIX_OUTDAI_1R_INDAI_1L_GAIN_OUTDAI_1R_INDAI_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1L_INFILT_1R_GAIN_REG, DMIX_OUTFILT_1L_INFILT_1R_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1L_INFILT_1R_GAIN_REG_adr 0x6E
#define DMIX_OUTFILT_1L_INFILT_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1L_INFILT_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1L_INFILT_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1L_INFILT_1R_GAIN_REG_type ;

#define DMIX_OUTFILT_1L_INFILT_1R_GAIN_OUTFILT_1L_INFILT_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1L_INDAI_1L_GAIN_REG, DMIX_OUTFILT_1L_INDAI_1L_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1L_INDAI_1L_GAIN_REG_adr 0x72
#define DMIX_OUTFILT_1L_INDAI_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1L_INDAI_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1L_INDAI_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1L_INDAI_1L_GAIN_REG_type ;

#define DMIX_OUTFILT_1L_INDAI_1L_GAIN_OUTFILT_1L_INDAI_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1R_INFILT_1R_GAIN_REG, DMIX_OUTFILT_1R_INFILT_1R_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1R_INFILT_1R_GAIN_REG_adr 0x76
#define DMIX_OUTFILT_1R_INFILT_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1R_INFILT_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1R_INFILT_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1R_INFILT_1R_GAIN_REG_type ;

#define DMIX_OUTFILT_1R_INFILT_1R_GAIN_OUTFILT_1R_INFILT_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1R_INDAI_1L_GAIN_REG, DMIX_OUTFILT_1R_INDAI_1L_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1R_INDAI_1L_GAIN_REG_adr 0x7A
#define DMIX_OUTFILT_1R_INDAI_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1R_INDAI_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1R_INDAI_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1R_INDAI_1L_GAIN_REG_type ;

#define DMIX_OUTFILT_1R_INDAI_1L_GAIN_OUTFILT_1R_INDAI_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1L_INFILT_2L_GAIN_REG, DMIX_OUTDAI_1L_INFILT_2L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1L_INFILT_2L_GAIN_REG_adr 0x5F
#define DMIX_OUTDAI_1L_INFILT_2L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1L_INFILT_2L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1L_INFILT_2L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1L_INFILT_2L_GAIN_REG_type ;

#define DMIX_OUTDAI_1L_INFILT_2L_GAIN_OUTDAI_1L_INFILT_2L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1L_INDAI_1R_GAIN_REG, DMIX_OUTDAI_1L_INDAI_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1L_INDAI_1R_GAIN_REG_adr 0x63
#define DMIX_OUTDAI_1L_INDAI_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1L_INDAI_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1L_INDAI_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1L_INDAI_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_1L_INDAI_1R_GAIN_OUTDAI_1L_INDAI_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1R_INFILT_2L_GAIN_REG, DMIX_OUTDAI_1R_INFILT_2L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1R_INFILT_2L_GAIN_REG_adr 0x67
#define DMIX_OUTDAI_1R_INFILT_2L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1R_INFILT_2L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1R_INFILT_2L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1R_INFILT_2L_GAIN_REG_type ;

#define DMIX_OUTDAI_1R_INFILT_2L_GAIN_OUTDAI_1R_INFILT_2L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_1R_INDAI_1R_GAIN_REG, DMIX_OUTDAI_1R_INDAI_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_1R_INDAI_1R_GAIN_REG_adr 0x6B
#define DMIX_OUTDAI_1R_INDAI_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_1R_INDAI_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_1R_INDAI_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_1R_INDAI_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_1R_INDAI_1R_GAIN_OUTDAI_1R_INDAI_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1L_INFILT_2L_GAIN_REG, DMIX_OUTFILT_1L_INFILT_2L_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1L_INFILT_2L_GAIN_REG_adr 0x6F
#define DMIX_OUTFILT_1L_INFILT_2L_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1L_INFILT_2L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1L_INFILT_2L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1L_INFILT_2L_GAIN_REG_type ;

#define DMIX_OUTFILT_1L_INFILT_2L_GAIN_OUTFILT_1L_INFILT_2L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1L_INDAI_1R_GAIN_REG, DMIX_OUTFILT_1L_INDAI_1R_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1L_INDAI_1R_GAIN_REG_adr 0x73
#define DMIX_OUTFILT_1L_INDAI_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1L_INDAI_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1L_INDAI_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1L_INDAI_1R_GAIN_REG_type ;

#define DMIX_OUTFILT_1L_INDAI_1R_GAIN_OUTFILT_1L_INDAI_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1R_INFILT_2L_GAIN_REG, DMIX_OUTFILT_1R_INFILT_2L_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1R_INFILT_2L_GAIN_REG_adr 0x77
#define DMIX_OUTFILT_1R_INFILT_2L_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1R_INFILT_2L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1R_INFILT_2L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1R_INFILT_2L_GAIN_REG_type ;

#define DMIX_OUTFILT_1R_INFILT_2L_GAIN_OUTFILT_1R_INFILT_2L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTFILT_1R_INDAI_1R_GAIN_REG, DMIX_OUTFILT_1R_INDAI_1R_GAIN description
****************************************************************************/

#define DMIX_OUTFILT_1R_INDAI_1R_GAIN_REG_adr 0x7B
#define DMIX_OUTFILT_1R_INDAI_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTFILT_1R_INDAI_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTFILT_1R_INDAI_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTFILT_1R_INDAI_1R_GAIN_REG_type ;

#define DMIX_OUTFILT_1R_INDAI_1R_GAIN_OUTFILT_1R_INDAI_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DROUTING_OUTDAI_2L_REG, DROUTING_OUTDAI_2L description
****************************************************************************/

#define DROUTING_OUTDAI_2L_REG_adr 0x7C
#define DROUTING_OUTDAI_2L_REG_reset 0x04
#define DROUTING_OUTDAI_2L_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_SRC        : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} DROUTING_OUTDAI_2L_REG_type ;

