phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DROUTING_OUTDAI_2L_OUTDAI_2L_SRC        0x007F // Bit 6-0

/****************************************************************************
* DMIX_OUTDAI_2L_INFILT_2R_GAIN_REG, DMIX_OUTDAI_2L_INFILT_2R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2L_INFILT_2R_GAIN_REG_adr 0x80
#define DMIX_OUTDAI_2L_INFILT_2R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2L_INFILT_2R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_INFILT_2R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2L_INFILT_2R_GAIN_REG_type ;

#define DMIX_OUTDAI_2L_INFILT_2R_GAIN_OUTDAI_2L_INFILT_2R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DROUTING_OUTDAI_2R_REG, DROUTING_OUTDAI_2R description
****************************************************************************/

#define DROUTING_OUTDAI_2R_REG_adr 0x84
#define DROUTING_OUTDAI_2R_REG_reset 0x08
#define DROUTING_OUTDAI_2R_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_SRC        : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} DROUTING_OUTDAI_2R_REG_type ;

#define DROUTING_OUTDAI_2R_OUTDAI_2R_SRC        0x007F // Bit 6-0

/****************************************************************************
* DMIX_OUTDAI_2R_INFILT_2R_GAIN_REG, DMIX_OUTDAI_2R_INFILT_2R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2R_INFILT_2R_GAIN_REG_adr 0x88
#define DMIX_OUTDAI_2R_INFILT_2R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2R_INFILT_2R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_INFILT_2R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2R_INFILT_2R_GAIN_REG_type ;

#define DMIX_OUTDAI_2R_INFILT_2R_GAIN_OUTDAI_2R_INFILT_2R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2L_INFILT_1L_GAIN_REG, DMIX_OUTFILT_2L_INFILT_1L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2L_INFILT_1L_GAIN_REG_adr 0x7D
#define DMIX_OUTDAI_2L_INFILT_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2L_INFILT_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_INFILT_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2L_INFILT_1L_GAIN_REG_type ;

#define DMIX_OUTDAI_2L_INFILT_1L_GAIN_OUTDAI_2L_INFILT_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2L_TONEGEN_GAIN_REG, DMIX_OUTDAI_2L_TONEGEN_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2L_TONEGEN_GAIN_REG_adr 0x81
#define DMIX_OUTDAI_2L_TONEGEN_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2L_TONEGEN_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_TONEGEN_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2L_TONEGEN_GAIN_REG_type ;

#define DMIX_OUTDAI_2L_TONEGEN_GAIN_OUTDAI_2L_TONEGEN_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2R_INFILT_1L_GAIN_REG, DMIX_OUTFILT_2R_INFILT_1L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2R_INFILT_1L_GAIN_REG_adr 0x85
#define DMIX_OUTDAI_2R_INFILT_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2R_INFILT_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_INFILT_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2R_INFILT_1L_GAIN_REG_type ;

#define DMIX_OUTDAI_2R_INFILT_1L_GAIN_OUTDAI_2R_INFILT_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2R_TONEGEN_GAIN_REG, DMIX_OUTDAI_2R_TONEGEN_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2R_TONEGEN_GAIN_REG_adr 0x89
#define DMIX_OUTDAI_2R_TONEGEN_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2R_TONEGEN_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_TONEGEN_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2R_TONEGEN_GAIN_REG_type ;

#define DMIX_OUTDAI_2R_TONEGEN_GAIN_OUTDAI_2R_TONEGEN_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2L_INFILT_1R_GAIN_REG, DMIX_OUTDAI_2L_INFILT_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2L_INFILT_1R_GAIN_REG_adr 0x7E
#define DMIX_OUTDAI_2L_INFILT_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2L_INFILT_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_INFILT_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2L_INFILT_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_2L_INFILT_1R_GAIN_OUTDAI_2L_INFILT_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2L_INDAI_1L_GAIN_REG, DMIX_OUTDAI_2L_INDAI_1L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2L_INDAI_1L_GAIN_REG_adr 0x82
#define DMIX_OUTDAI_2L_INDAI_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2L_INDAI_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_INDAI_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2L_INDAI_1L_GAIN_REG_type ;

