phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DMIX_OUTDAI_2L_INDAI_1L_GAIN_OUTDAI_2L_INDAI_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2R_INFILT_1R_GAIN_REG, DMIX_OUTDAI_2R_INFILT_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2R_INFILT_1R_GAIN_REG_adr 0x86
#define DMIX_OUTDAI_2R_INFILT_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2R_INFILT_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_INFILT_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2R_INFILT_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_2R_INFILT_1R_GAIN_OUTDAI_2R_INFILT_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2R_INDAI_1L_GAIN_REG, DMIX_OUTDAI_2R_INDAI_1L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2R_INDAI_1L_GAIN_REG_adr 0x8A
#define DMIX_OUTDAI_2R_INDAI_1L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2R_INDAI_1L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_INDAI_1L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2R_INDAI_1L_GAIN_REG_type ;

#define DMIX_OUTDAI_2R_INDAI_1L_GAIN_OUTDAI_2R_INDAI_1L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2L_INFILT_2L_GAIN_REG, DMIX_OUTDAI_2L_INFILT_2L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2L_INFILT_2L_GAIN_REG_adr 0x7F
#define DMIX_OUTDAI_2L_INFILT_2L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2L_INFILT_2L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_INFILT_2L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2L_INFILT_2L_GAIN_REG_type ;

#define DMIX_OUTDAI_2L_INFILT_2L_GAIN_OUTDAI_2L_INFILT_2L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2L_INDAI_1R_GAIN_REG, DMIX_OUTDAI_2L_INDAI_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2L_INDAI_1R_GAIN_REG_adr 0x83
#define DMIX_OUTDAI_2L_INDAI_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2L_INDAI_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2L_INDAI_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2L_INDAI_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_2L_INDAI_1R_GAIN_OUTDAI_2L_INDAI_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2R_INFILT_2L_GAIN_REG, DMIX_OUTDAI_2R_INFILT_2L_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2R_INFILT_2L_GAIN_REG_adr 0x87
#define DMIX_OUTDAI_2R_INFILT_2L_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2R_INFILT_2L_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_INFILT_2L_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2R_INFILT_2L_GAIN_REG_type ;

#define DMIX_OUTDAI_2R_INFILT_2L_GAIN_OUTDAI_2R_INFILT_2L_GAIN  0x001F // Bit 4-0

/****************************************************************************
* DMIX_OUTDAI_2R_INDAI_1R_GAIN_REG, DMIX_OUTDAI_2R_INDAI_1R_GAIN description
****************************************************************************/

#define DMIX_OUTDAI_2R_INDAI_1R_GAIN_REG_adr 0x8B
#define DMIX_OUTDAI_2R_INDAI_1R_GAIN_REG_reset 0x1C
#define DMIX_OUTDAI_2R_INDAI_1R_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OUTDAI_2R_INDAI_1R_GAIN  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} DMIX_OUTDAI_2R_INDAI_1R_GAIN_REG_type ;

#define DMIX_OUTDAI_2R_INDAI_1R_GAIN_OUTDAI_2R_INDAI_1R_GAIN  0x001F // Bit 4-0

/****************************************************************************
* Module: memoryMap9
* Range.: 0x8C..0x90, 0x5
****************************************************************************/

/****************************************************************************
* DAI_CTRL_REG, DAI_CTRL description
****************************************************************************/

#define DAI_CTRL_REG_adr 0x8C
#define DAI_CTRL_REG_reset 0x28
#define DAI_CTRL_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DAI_FORMAT           : 2; // Bit 1-0
    unsigned char DAI_WORD_LENGTH      : 2; // Bit 3-2
    unsigned char DAI_CH_NUM           : 3; // Bit 6-4
    unsigned char DAI_EN               : 1; // Bit 7
  };
} DAI_CTRL_REG_type ;

#define DAI_CTRL_DAI_FORMAT           0x0003 // Bit 1-0
#define DAI_CTRL_DAI_WORD_LENGTH      0x000C // Bit 3-2
#define DAI_CTRL_DAI_CH_NUM           0x0070 // Bit 6-4
#define DAI_CTRL_DAI_EN               0x0080 // Bit 7

/****************************************************************************
* DAI_CLK_MODE_REG, DAI_CLK_MODE description
****************************************************************************/

#define DAI_CLK_MODE_REG_adr 0x90
#define DAI_CLK_MODE_REG_reset 0x01
#define DAI_CLK_MODE_REG_mask 0x9F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DAI_BCLKS_PER_WCLK   : 2; // Bit 1-0
    unsigned char DAI_CLK_POL          : 1; // Bit 2
    unsigned char DAI_WCLK_POL         : 1; // Bit 3
    unsigned char DAI_WCLK_TRI_STATE   : 1; // Bit 4
    unsigned char _reserved_5_         : 2; // Bit 6-5
    unsigned char DAI_CLK_EN           : 1; // Bit 7
  };
} DAI_CLK_MODE_REG_type ;

#define DAI_CLK_MODE_DAI_BCLKS_PER_WCLK   0x0003 // Bit 1-0
#define DAI_CLK_MODE_DAI_CLK_POL          0x0004 // Bit 2
#define DAI_CLK_MODE_DAI_WCLK_POL         0x0008 // Bit 3
#define DAI_CLK_MODE_DAI_WCLK_TRI_STATE   0x0010 // Bit 4
#define DAI_CLK_MODE__reserved_5_         0x0060 // Bit 6-5
#define DAI_CLK_MODE_DAI_CLK_EN           0x0080 // Bit 7

/****************************************************************************
* DAI_TDM_CTRL_REG,
****************************************************************************/

