phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DAI_TDM_CTRL_REG_adr 0x8D
#define DAI_TDM_CTRL_REG_reset 0x40
#define DAI_TDM_CTRL_REG_mask 0xCF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DAI_TDM_CH_EN        : 4; // Bit 3-0
    unsigned char _reserved_4_         : 2; // Bit 5-4
    unsigned char DAI_OE               : 1; // Bit 6
    unsigned char DAI_TDM_MODE_EN      : 1; // Bit 7
  };
} DAI_TDM_CTRL_REG_type ;

#define DAI_TDM_CTRL_DAI_TDM_CH_EN        0x000F // Bit 3-0
#define DAI_TDM_CTRL__reserved_4_         0x0030 // Bit 5-4
#define DAI_TDM_CTRL_DAI_OE               0x0040 // Bit 6
#define DAI_TDM_CTRL_DAI_TDM_MODE_EN      0x0080 // Bit 7

/****************************************************************************
* DAI_OFFSET_LOWER_REG, DAI_OFFSET_LOWER description
****************************************************************************/

#define DAI_OFFSET_LOWER_REG_adr 0x8E
#define DAI_OFFSET_LOWER_REG_reset 0x00
#define DAI_OFFSET_LOWER_REG_mask 0xFF

/****************************************************************************
* DAI_OFFSET_UPPER_REG, DAI_OFFSET_UPPER description
****************************************************************************/

#define DAI_OFFSET_UPPER_REG_adr 0x8F
#define DAI_OFFSET_UPPER_REG_reset 0x00
#define DAI_OFFSET_UPPER_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DAI_OFFSET_UPPER     : 3; // Bit 2-0
    unsigned char                      : 5; // Bit 7-3
  };
} DAI_OFFSET_UPPER_REG_type ;

#define DAI_OFFSET_UPPER_DAI_OFFSET_UPPER     0x0007 // Bit 2-0

/****************************************************************************
* Module: memoryMap27
* Range.: 0x91..0x98, 0x8
****************************************************************************/

/****************************************************************************
* PLL_CTRL_REG, PLL_CTRL description
****************************************************************************/

#define PLL_CTRL_REG_adr 0x91
#define PLL_CTRL_REG_reset 0x04
#define PLL_CTRL_REG_mask 0xD7

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char PLL_INDIV            : 3; // Bit 2-0
    unsigned char _reserved_3_         : 1; // Bit 3
    unsigned char PLL_MCLK_SQR_EN      : 1; // Bit 4
    unsigned char _reserved_5_         : 1; // Bit 5
    unsigned char PLL_MODE             : 2; // Bit 7-6
  };
} PLL_CTRL_REG_type ;

#define PLL_CTRL_PLL_INDIV            0x0007 // Bit 2-0
#define PLL_CTRL__reserved_3_         0x0008 // Bit 3
#define PLL_CTRL_PLL_MCLK_SQR_EN      0x0010 // Bit 4
#define PLL_CTRL__reserved_5_         0x0020 // Bit 5
#define PLL_CTRL_PLL_MODE             0x00C0 // Bit 7-6

/****************************************************************************
* PLL_FRAC_TOP_REG, PLL_FRAC_TOP description
****************************************************************************/

#define PLL_FRAC_TOP_REG_adr 0x92
#define PLL_FRAC_TOP_REG_reset 0x00
#define PLL_FRAC_TOP_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char PLL_FBDIV_FRAC_TOP   : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} PLL_FRAC_TOP_REG_type ;

#define PLL_FRAC_TOP_PLL_FBDIV_FRAC_TOP   0x001F // Bit 4-0

/****************************************************************************
* PLL_FRAC_BOT_REG, PLL_FRAC_BOT description
****************************************************************************/

#define PLL_FRAC_BOT_REG_adr 0x93
#define PLL_FRAC_BOT_REG_reset 0x00
#define PLL_FRAC_BOT_REG_mask 0xFF

/****************************************************************************
* PLL_INTEGER_REG, PLL_INTEGER description
****************************************************************************/

#define PLL_INTEGER_REG_adr 0x94
#define PLL_INTEGER_REG_reset 0x20
#define PLL_INTEGER_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char PLL_FBDIV_INTEGER    : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} PLL_INTEGER_REG_type ;

#define PLL_INTEGER_PLL_FBDIV_INTEGER    0x007F // Bit 6-0

/****************************************************************************
* PLL_STATUS_REG, PLL_STATUS description
****************************************************************************/

#define PLL_STATUS_REG_adr 0x95
#define PLL_STATUS_REG_reset 0x00
#define PLL_STATUS_REG_mask 0xFF

/****************************************************************************
* PLL_REFOSC_CAL_REG, PLL_REFOSC_CAL description
****************************************************************************/

#define PLL_REFOSC_CAL_REG_adr 0x98
#define PLL_REFOSC_CAL_REG_reset 0x00
#define PLL_REFOSC_CAL_REG_mask 0xDF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char PLL_REFOSC_CAL_CTRL  : 5; // Bit 4-0
    unsigned char _reserved_5_         : 1; // Bit 5
    unsigned char PLL_REFOSC_CAL_START  : 1; // Bit 6
    unsigned char PLL_REFOSC_CAL_EN    : 1; // Bit 7
  };
} PLL_REFOSC_CAL_REG_type ;

#define PLL_REFOSC_CAL_PLL_REFOSC_CAL_CTRL  0x001F // Bit 4-0
#define PLL_REFOSC_CAL__reserved_5_         0x0020 // Bit 5
#define PLL_REFOSC_CAL_PLL_REFOSC_CAL_START  0x0040 // Bit 6
#define PLL_REFOSC_CAL_PLL_REFOSC_CAL_EN    0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap8
* Range.: 0x9C..0x9F, 0x4
****************************************************************************/

/****************************************************************************
* DAC_NG_CTRL_REG, DAC_NG_CTRL description
****************************************************************************/

#define DAC_NG_CTRL_REG_adr 0x9C
#define DAC_NG_CTRL_REG_reset 0x00
#define DAC_NG_CTRL_REG_mask 0x80

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 7;
    unsigned char DAC_NG_EN            : 1; // Bit 7
  };
} DAC_NG_CTRL_REG_type ;

#define DAC_NG_CTRL_DAC_NG_EN            0x0080 // Bit 7

/****************************************************************************
* DAC_NG_SETUP_TIME_REG, DAC_NG_SETUP_TIME description
****************************************************************************/

#define DAC_NG_SETUP_TIME_REG_adr 0x9D
#define DAC_NG_SETUP_TIME_REG_reset 0x00
#define DAC_NG_SETUP_TIME_REG_mask 0x0F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DAC_NG_SETUP_TIME    : 2; // Bit 1-0
    unsigned char DAC_NG_RAMPUP_RATE   : 1; // Bit 2
    unsigned char DAC_NG_RAMPDN_RATE   : 1; // Bit 3
    unsigned char                      : 4; // Bit 7-4
  };
} DAC_NG_SETUP_TIME_REG_type ;

#define DAC_NG_SETUP_TIME_DAC_NG_SETUP_TIME    0x0003 // Bit 1-0
#define DAC_NG_SETUP_TIME_DAC_NG_RAMPUP_RATE   0x0004 // Bit 2
#define DAC_NG_SETUP_TIME_DAC_NG_RAMPDN_RATE   0x0008 // Bit 3

/****************************************************************************
* DAC_NG_OFF_THRESH_REG, DAC_NG_OFF_THRESH description
****************************************************************************/

#define DAC_NG_OFF_THRESH_REG_adr 0x9E
#define DAC_NG_OFF_THRESH_REG_reset 0x00
#define DAC_NG_OFF_THRESH_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DAC_NG_OFF_THRESHOLD  : 3; // Bit 2-0
    unsigned char                      : 5; // Bit 7-3
  };
} DAC_NG_OFF_THRESH_REG_type ;

#define DAC_NG_OFF_THRESH_DAC_NG_OFF_THRESHOLD  0x0007 // Bit 2-0

/****************************************************************************
* DAC_NG_ON_THRESH_REG, DAC_NG_ON_THRESH description
****************************************************************************/

