phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DAC_NG_ON_THRESH_REG_adr 0x9F
#define DAC_NG_ON_THRESH_REG_reset 0x00
#define DAC_NG_ON_THRESH_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DAC_NG_ON_THRESHOLD  : 3; // Bit 2-0
    unsigned char                      : 5; // Bit 7-3
  };
} DAC_NG_ON_THRESH_REG_type ;

#define DAC_NG_ON_THRESH_DAC_NG_ON_THRESHOLD  0x0007 // Bit 2-0

/****************************************************************************
* Module: memoryMap32
* Range.: 0xA0..0xA8, 0x9
****************************************************************************/

/****************************************************************************
* TONE_GEN_CFG1_REG, TONE_GEN_CFG1 description
****************************************************************************/

#define TONE_GEN_CFG1_REG_adr 0xA0
#define TONE_GEN_CFG1_REG_reset 0x00
#define TONE_GEN_CFG1_REG_mask 0x9F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DTMF_REG             : 4; // Bit 3-0
    unsigned char DTMF_EN              : 1; // Bit 4
    unsigned char _reserved_5_         : 2; // Bit 6-5
    unsigned char START_STOPN          : 1; // Bit 7
  };
} TONE_GEN_CFG1_REG_type ;

#define TONE_GEN_CFG1_DTMF_REG             0x000F // Bit 3-0
#define TONE_GEN_CFG1_DTMF_EN              0x0010 // Bit 4
#define TONE_GEN_CFG1__reserved_5_         0x0060 // Bit 6-5
#define TONE_GEN_CFG1_START_STOPN          0x0080 // Bit 7

/****************************************************************************
* TONE_GEN_CFG2_REG, TONE_GEN_CFG2 description
****************************************************************************/

#define TONE_GEN_CFG2_REG_adr 0xA1
#define TONE_GEN_CFG2_REG_reset 0x00
#define TONE_GEN_CFG2_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char SWG_SEL              : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} TONE_GEN_CFG2_REG_type ;

#define TONE_GEN_CFG2_SWG_SEL              0x0003 // Bit 1-0

/****************************************************************************
* TONE_GEN_FREQ1_L_REG, TONE_GEN_FREQ1_L description
****************************************************************************/

#define TONE_GEN_FREQ1_L_REG_adr 0xA2
#define TONE_GEN_FREQ1_L_REG_reset 0x55
#define TONE_GEN_FREQ1_L_REG_mask 0xFF

/****************************************************************************
* TONE_GEN_FREQ1_U_REG, TONE_GEN_FREQ1_U description
****************************************************************************/

#define TONE_GEN_FREQ1_U_REG_adr 0xA3
#define TONE_GEN_FREQ1_U_REG_reset 0x15
#define TONE_GEN_FREQ1_U_REG_mask 0xFF

/****************************************************************************
* TONE_GEN_FREQ2_L_REG, TONE_GEN_FREQ2_L description
****************************************************************************/

#define TONE_GEN_FREQ2_L_REG_adr 0xA4
#define TONE_GEN_FREQ2_L_REG_reset 0x00
#define TONE_GEN_FREQ2_L_REG_mask 0xFF

/****************************************************************************
* TONE_GEN_FREQ2_U_REG, TONE_GEN_FREQ2_U description
****************************************************************************/

#define TONE_GEN_FREQ2_U_REG_adr 0xA5
#define TONE_GEN_FREQ2_U_REG_reset 0x40
#define TONE_GEN_FREQ2_U_REG_mask 0xFF

/****************************************************************************
* TONE_GEN_CYCLES_REG, TONE_GEN_CYCLES description
****************************************************************************/

#define TONE_GEN_CYCLES_REG_adr 0xA6
#define TONE_GEN_CYCLES_REG_reset 0x00
#define TONE_GEN_CYCLES_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char BEEP_CYCLES          : 3; // Bit 2-0
    unsigned char                      : 5; // Bit 7-3
  };
} TONE_GEN_CYCLES_REG_type ;

#define TONE_GEN_CYCLES_BEEP_CYCLES          0x0007 // Bit 2-0

/****************************************************************************
* TONE_GEN_ON_PER_REG, TONE_GEN_ON_PER description
****************************************************************************/

#define TONE_GEN_ON_PER_REG_adr 0xA7
#define TONE_GEN_ON_PER_REG_reset 0x02
#define TONE_GEN_ON_PER_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char BEEP_ON_PER          : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} TONE_GEN_ON_PER_REG_type ;

#define TONE_GEN_ON_PER_BEEP_ON_PER          0x003F // Bit 5-0

/****************************************************************************
* TONE_GEN_OFF_PER_REG, TONE_GEN_OFF_PER description
****************************************************************************/

#define TONE_GEN_OFF_PER_REG_adr 0xA8
#define TONE_GEN_OFF_PER_REG_reset 0x01
#define TONE_GEN_OFF_PER_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char BEEP_OFF_PER         : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} TONE_GEN_OFF_PER_REG_type ;

#define TONE_GEN_OFF_PER_BEEP_OFF_PER         0x003F // Bit 5-0

/****************************************************************************
* Module: memoryMap4
* Range.: 0xAC..0xAE, 0x3
****************************************************************************/

/****************************************************************************
* CP_CTRL_REG, CP_CTRL description
****************************************************************************/

#define CP_CTRL_REG_adr 0xAC
#define CP_CTRL_REG_reset 0x60
#define CP_CTRL_REG_mask 0xFC

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 2;
    unsigned char CP_MOD               : 2; // Bit 3-2
    unsigned char CP_MCHANGE           : 2; // Bit 5-4
    unsigned char CP_SMALL_SWITCH_FREQ_EN  : 1; // Bit 6
    unsigned char CP_EN                : 1; // Bit 7
  };
} CP_CTRL_REG_type ;

#define CP_CTRL_CP_MOD               0x000C // Bit 3-2
#define CP_CTRL_CP_MCHANGE           0x0030 // Bit 5-4
#define CP_CTRL_CP_SMALL_SWITCH_FREQ_EN  0x0040 // Bit 6
#define CP_CTRL_CP_EN                0x0080 // Bit 7

/****************************************************************************
* CP_DELAY_REG, CP_DELAY description
****************************************************************************/

