phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define CP_DELAY_REG_adr 0xAD
#define CP_DELAY_REG_reset 0x11
#define CP_DELAY_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char CP_FCONTROL          : 3; // Bit 2-0
    unsigned char CP_TAU_DELAY         : 3; // Bit 5-3
    unsigned char                      : 2; // Bit 7-6
  };
} CP_DELAY_REG_type ;

#define CP_DELAY_CP_FCONTROL          0x0007 // Bit 2-0
#define CP_DELAY_CP_TAU_DELAY         0x0038 // Bit 5-3

/****************************************************************************
* CP_VOL_THRESHOLD1_REG, CP_VOL_THRESHOLD1 description
****************************************************************************/

#define CP_VOL_THRESHOLD1_REG_adr 0xAE
#define CP_VOL_THRESHOLD1_REG_reset 0x0E
#define CP_VOL_THRESHOLD1_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char CP_THRESH_VDD2       : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} CP_VOL_THRESHOLD1_REG_type ;

#define CP_VOL_THRESHOLD1_CP_THRESH_VDD2       0x003F // Bit 5-0

/****************************************************************************
* Module: memoryMap21
* Range.: 0xB4..0xBB, 0x8
****************************************************************************/

/****************************************************************************
* MIC_1_CTRL_REG, MIC_1_CTRL description
****************************************************************************/

#define MIC_1_CTRL_REG_adr 0xB4
#define MIC_1_CTRL_REG_reset 0x40
#define MIC_1_CTRL_REG_mask 0xF3

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIC_AMP_BIAS         : 2; // Bit 1-0
    unsigned char _reserved_2_         : 2; // Bit 3-2
    unsigned char MIC_1_AMP_ZC_EN      : 1; // Bit 4
    unsigned char FIELD2               : 1; // Bit 5
    unsigned char MIC_1_AMP_MUTE_EN    : 1; // Bit 6
    unsigned char MIC_1_AMP_EN         : 1; // Bit 7
  };
} MIC_1_CTRL_REG_type ;

#define MIC_1_CTRL_MIC_AMP_BIAS         0x0003 // Bit 1-0
#define MIC_1_CTRL__reserved_2_         0x000C // Bit 3-2
#define MIC_1_CTRL_MIC_1_AMP_ZC_EN      0x0010 // Bit 4
#define MIC_1_CTRL_FIELD2               0x0020 // Bit 5
#define MIC_1_CTRL_MIC_1_AMP_MUTE_EN    0x0040 // Bit 6
#define MIC_1_CTRL_MIC_1_AMP_EN         0x0080 // Bit 7

/****************************************************************************
* MIC_2_CTRL_REG, MIC_2_CTRL description
****************************************************************************/

#define MIC_2_CTRL_REG_adr 0xB8
#define MIC_2_CTRL_REG_reset 0x40
#define MIC_2_CTRL_REG_mask 0xF0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 4;
    unsigned char MIC_2_AMP_ZC_EN      : 1; // Bit 4
    unsigned char FIELD2               : 1; // Bit 5
    unsigned char MIC_2_AMP_MUTE_EN    : 1; // Bit 6
    unsigned char MIC_2_AMP_EN         : 1; // Bit 7
  };
} MIC_2_CTRL_REG_type ;

#define MIC_2_CTRL_MIC_2_AMP_ZC_EN      0x0010 // Bit 4
#define MIC_2_CTRL_FIELD2               0x0020 // Bit 5
#define MIC_2_CTRL_MIC_2_AMP_MUTE_EN    0x0040 // Bit 6
#define MIC_2_CTRL_MIC_2_AMP_EN         0x0080 // Bit 7

/****************************************************************************
* MIC_1_GAIN_REG, MIC_1_GAIN description
****************************************************************************/

#define MIC_1_GAIN_REG_adr 0xB5
#define MIC_1_GAIN_REG_reset 0x01
#define MIC_1_GAIN_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIC_1_AMP_GAIN       : 3; // Bit 2-0
    unsigned char                      : 5; // Bit 7-3
  };
} MIC_1_GAIN_REG_type ;

#define MIC_1_GAIN_MIC_1_AMP_GAIN       0x0007 // Bit 2-0

/****************************************************************************
* MIC_2_GAIN_REG, MIC_2_GAIN description
****************************************************************************/

#define MIC_2_GAIN_REG_adr 0xB9
#define MIC_2_GAIN_REG_reset 0x01
#define MIC_2_GAIN_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIC_2_AMP_GAIN       : 3; // Bit 2-0
    unsigned char                      : 5; // Bit 7-3
  };
} MIC_2_GAIN_REG_type ;

#define MIC_2_GAIN_MIC_2_AMP_GAIN       0x0007 // Bit 2-0

/****************************************************************************
* MIC_1_SELECT_REG, MIC_1_SELECT description
****************************************************************************/

#define MIC_1_SELECT_REG_adr 0xB7
#define MIC_1_SELECT_REG_reset 0x00
#define MIC_1_SELECT_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIC_1_AMP_IN_SEL     : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} MIC_1_SELECT_REG_type ;

#define MIC_1_SELECT_MIC_1_AMP_IN_SEL     0x0003 // Bit 1-0

/****************************************************************************
* MIC_2_SELECT_REG, MIC_2_SELECT description
****************************************************************************/

#define MIC_2_SELECT_REG_adr 0xBB
#define MIC_2_SELECT_REG_reset 0x00
#define MIC_2_SELECT_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIC_2_AMP_IN_SEL     : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} MIC_2_SELECT_REG_type ;

#define MIC_2_SELECT_MIC_2_AMP_IN_SEL     0x0003 // Bit 1-0

/****************************************************************************
* Module: memoryMap17
* Range.: 0xBC..0xBD, 0x2
****************************************************************************/

/****************************************************************************
* IN_1_HPF_FILTER_CTRL_REG, IN_1_FILTER_CTRL description
****************************************************************************/

#define IN_1_HPF_FILTER_CTRL_REG_adr 0xBC
#define IN_1_HPF_FILTER_CTRL_REG_reset 0x80
#define IN_1_HPF_FILTER_CTRL_REG_mask 0xBF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char IN_VOICE_HPF_CORNER  : 3; // Bit 2-0
    unsigned char IN_VOICE_EN          : 1; // Bit 3
    unsigned char IN_AUDIO_HPF_CORNER  : 2; // Bit 5-4
    unsigned char _reserved_6_         : 1; // Bit 6
    unsigned char IN_HPF_EN            : 1; // Bit 7
  };
} IN_1_HPF_FILTER_CTRL_REG_type ;

#define IN_1_HPF_FILTER_CTRL_IN_1_VOICE_HPF_CORNER  0x0007 // Bit 2-0
#define IN_1_HPF_FILTER_CTRL_IN_1_VOICE_EN        0x0008 // Bit 3
#define IN_1_HPF_FILTER_CTRL_IN_1_AUDIO_HPF_CORNER  0x0030 // Bit 5-4
#define IN_1_HPF_FILTER_CTRL__reserved_6_         0x0040 // Bit 6
#define IN_1_HPF_FILTER_CTRL_IN_1_HPF_EN          0x0080 // Bit 7

/****************************************************************************
* IN_2_HPF_FILTER_CTRL_REG, IN_2_FILTER_CTRL description
****************************************************************************/

#define IN_2_HPF_FILTER_CTRL_REG_adr 0xBD
#define IN_2_HPF_FILTER_CTRL_REG_reset 0x80
#define IN_2_HPF_FILTER_CTRL_REG_mask 0xBF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char IN_2_VOICE_HPF_CORNER  : 3; // Bit 2-0
    unsigned char IN_2_VOICE_EN        : 1; // Bit 3
    unsigned char IN_2_AUDIO_HPF_CORNER  : 2; // Bit 5-4
    unsigned char _reserved_6_         : 1; // Bit 6
    unsigned char IN_2_HPF_EN          : 1; // Bit 7
  };
} IN_2_HPF_FILTER_CTRL_REG_type ;

#define IN_2_HPF_FILTER_CTRL_IN_2_VOICE_HPF_CORNER  0x0007 // Bit 2-0
#define IN_2_HPF_FILTER_CTRL_IN_2_VOICE_EN        0x0008 // Bit 3
#define IN_2_HPF_FILTER_CTRL_IN_2_AUDIO_HPF_CORNER  0x0030 // Bit 5-4
#define IN_2_HPF_FILTER_CTRL__reserved_6_         0x0040 // Bit 6
#define IN_2_HPF_FILTER_CTRL_IN_2_HPF_EN          0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap0
* Range.: 0xC0..0xC2, 0x3
****************************************************************************/

/****************************************************************************
* ADC_1_CTRL_REG, ADC_1L_CTRL description
****************************************************************************/

#define ADC_1_CTRL_REG_adr 0xC0
#define ADC_1_CTRL_REG_reset 0x07
#define ADC_1_CTRL_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ADC_1_DWA_EN         : 1; // Bit 0
    unsigned char ADC_1_DWABBL_EN      : 1; // Bit 1
    unsigned char ADC_1_AAF_EN         : 1; // Bit 2
    unsigned char                      : 5; // Bit 7-3
  };
} ADC_1_CTRL_REG_type ;

#define ADC_1_CTRL_ADC_1_DWA_EN         0x0001 // Bit 0
#define ADC_1_CTRL_ADC_1_DWABBL_EN      0x0002 // Bit 1
#define ADC_1_CTRL_ADC_1_AAF_EN         0x0004 // Bit 2

/****************************************************************************
* ADC_2_CTRL_REG, ADC_2L_CTRL description
****************************************************************************/

#define ADC_2_CTRL_REG_adr 0xC1
#define ADC_2_CTRL_REG_reset 0x07
#define ADC_2_CTRL_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ADC_2_DWA_EN         : 1; // Bit 0
    unsigned char ADC_2_DWABBL_EN      : 1; // Bit 1
    unsigned char ADC_2_AAF_EN         : 1; // Bit 2
    unsigned char                      : 5; // Bit 7-3
  };
} ADC_2_CTRL_REG_type ;

#define ADC_2_CTRL_ADC_2_DWA_EN         0x0001 // Bit 0
#define ADC_2_CTRL_ADC_2_DWABBL_EN      0x0002 // Bit 1
#define ADC_2_CTRL_ADC_2_AAF_EN         0x0004 // Bit 2

/****************************************************************************
* ADC_MODE_REG, ADC_MODE description
****************************************************************************/

#define ADC_MODE_REG_adr 0xC2
#define ADC_MODE_REG_reset 0x00
#define ADC_MODE_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char ADC_LP_MODE          : 1; // Bit 0
    unsigned char ADC_LVLDET_MODE      : 1; // Bit 1
    unsigned char ADC_LVLDET_AUTO_EXIT  : 1; // Bit 2
    unsigned char                      : 5; // Bit 7-3
  };
} ADC_MODE_REG_type ;

