phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define ADC_MODE_ADC_LP_MODE          0x0001 // Bit 0
#define ADC_MODE_ADC_LVLDET_MODE      0x0002 // Bit 1
#define ADC_MODE_ADC_LVLDET_AUTO_EXIT  0x0004 // Bit 2

/****************************************************************************
* Module: memoryMap24
* Range.: 0xCC..0xCF, 0x4
****************************************************************************/

/****************************************************************************
* MIXOUT_L_CTRL_REG, MIXOUT_L_CTRL description
****************************************************************************/

#define MIXOUT_L_CTRL_REG_adr 0xCC
#define MIXOUT_L_CTRL_REG_reset 0x00
#define MIXOUT_L_CTRL_REG_mask 0x83

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIXOUT_AMP_BIAS      : 2; // Bit 1-0
    unsigned char _reserved_2_         : 5; // Bit 6-2
    unsigned char MIXOUT_L_AMP_EN      : 1; // Bit 7
  };
} MIXOUT_L_CTRL_REG_type ;

#define MIXOUT_L_CTRL_MIXOUT_AMP_BIAS      0x0003 // Bit 1-0
#define MIXOUT_L_CTRL__reserved_2_         0x007C // Bit 6-2
#define MIXOUT_L_CTRL_MIXOUT_L_AMP_EN      0x0080 // Bit 7

/****************************************************************************
* MIXOUT_L_GAIN_REG, MIXOUT_L_GAIN description
****************************************************************************/

#define MIXOUT_L_GAIN_REG_adr 0xCD
#define MIXOUT_L_GAIN_REG_reset 0x03
#define MIXOUT_L_GAIN_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIXOUT_L_AMP_GAIN    : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} MIXOUT_L_GAIN_REG_type ;

#define MIXOUT_L_GAIN_MIXOUT_L_AMP_GAIN    0x0003 // Bit 1-0

/****************************************************************************
* MIXOUT_R_CTRL_REG, MIXOUT_R_CTRL description
****************************************************************************/

#define MIXOUT_R_CTRL_REG_adr 0xCE
#define MIXOUT_R_CTRL_REG_reset 0x00
#define MIXOUT_R_CTRL_REG_mask 0x80

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 7;
    unsigned char MIXOUT_R_AMP_EN      : 1; // Bit 7
  };
} MIXOUT_R_CTRL_REG_type ;

#define MIXOUT_R_CTRL_MIXOUT_R_AMP_EN      0x0080 // Bit 7

/****************************************************************************
* MIXOUT_R_GAIN_REG, MIXOUT_R_GAIN description
****************************************************************************/

#define MIXOUT_R_GAIN_REG_adr 0xCF
#define MIXOUT_R_GAIN_REG_reset 0x03
#define MIXOUT_R_GAIN_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MIXOUT_R_AMP_GAIN    : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} MIXOUT_R_GAIN_REG_type ;

#define MIXOUT_R_GAIN_MIXOUT_R_AMP_GAIN    0x0003 // Bit 1-0

/****************************************************************************
* Module: memoryMap14
* Range.: 0xD0..0xD7, 0x8
****************************************************************************/

/****************************************************************************
* HP_L_CTRL_REG, HP_L_CTRL description
****************************************************************************/

#define HP_L_CTRL_REG_adr 0xD0
#define HP_L_CTRL_REG_reset 0x40
#define HP_L_CTRL_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char HP_AMP_BIAS          : 2; // Bit 1-0
    unsigned char HP_L_AMP_MIN_GAIN_EN  : 1; // Bit 2
    unsigned char HP_L_AMP_OE          : 1; // Bit 3
    unsigned char HP_L_AMP_ZC_EN       : 1; // Bit 4
    unsigned char HP_L_AMP_RAMP_EN     : 1; // Bit 5
    unsigned char HP_L_AMP_MUTE_EN     : 1; // Bit 6
    unsigned char HP_L_AMP_EN          : 1; // Bit 7
  };
} HP_L_CTRL_REG_type ;

#define HP_L_CTRL_HP_AMP_BIAS          0x0003 // Bit 1-0
#define HP_L_CTRL_HP_L_AMP_MIN_GAIN_EN  0x0004 // Bit 2
#define HP_L_CTRL_HP_L_AMP_OE          0x0008 // Bit 3
#define HP_L_CTRL_HP_L_AMP_ZC_EN       0x0010 // Bit 4
#define HP_L_CTRL_HP_L_AMP_RAMP_EN     0x0020 // Bit 5
#define HP_L_CTRL_HP_L_AMP_MUTE_EN     0x0040 // Bit 6
#define HP_L_CTRL_HP_L_AMP_EN          0x0080 // Bit 7

/****************************************************************************
* HP_L_GAIN_REG, HP_L_GAIN description
****************************************************************************/

#define HP_L_GAIN_REG_adr 0xD1
#define HP_L_GAIN_REG_reset 0x3B
#define HP_L_GAIN_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char HP_L_AMP_GAIN        : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} HP_L_GAIN_REG_type ;

#define HP_L_GAIN_HP_L_AMP_GAIN        0x003F // Bit 5-0

/****************************************************************************
* HP_R_CTRL_REG, HP_R_CTRL description
****************************************************************************/

#define HP_R_CTRL_REG_adr 0xD2
#define HP_R_CTRL_REG_reset 0x40
#define HP_R_CTRL_REG_mask 0xFC

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 2;
    unsigned char HP_R_AMP_MIN_GAIN_EN  : 1; // Bit 2
    unsigned char HP_R_AMP_OE          : 1; // Bit 3
    unsigned char HP_R_AMP_ZC_EN       : 1; // Bit 4
    unsigned char HP_R_AMP_RAMP_EN     : 1; // Bit 5
    unsigned char HP_R_AMP_MUTE_EN     : 1; // Bit 6
    unsigned char HP_R_AMP_EN          : 1; // Bit 7
  };
} HP_R_CTRL_REG_type ;

#define HP_R_CTRL_HP_R_AMP_MIN_GAIN_EN  0x0004 // Bit 2
#define HP_R_CTRL_HP_R_AMP_OE          0x0008 // Bit 3
#define HP_R_CTRL_HP_R_AMP_ZC_EN       0x0010 // Bit 4
#define HP_R_CTRL_HP_R_AMP_RAMP_EN     0x0020 // Bit 5
#define HP_R_CTRL_HP_R_AMP_MUTE_EN     0x0040 // Bit 6
#define HP_R_CTRL_HP_R_AMP_EN          0x0080 // Bit 7

/****************************************************************************
* HP_R_GAIN_REG, HP_R_GAIN description
****************************************************************************/

#define HP_R_GAIN_REG_adr 0xD3
#define HP_R_GAIN_REG_reset 0x3B
#define HP_R_GAIN_REG_mask 0x3F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char HP_R_AMP_GAIN        : 6; // Bit 5-0
    unsigned char                      : 2; // Bit 7-6
  };
} HP_R_GAIN_REG_type ;

#define HP_R_GAIN_HP_R_AMP_GAIN        0x003F // Bit 5-0

/****************************************************************************
* HP_SNGL_CTRL_REG, HP_CTRL description
****************************************************************************/

#define HP_SNGL_CTRL_REG_adr 0xD4
#define HP_SNGL_CTRL_REG_reset 0x00
#define HP_SNGL_CTRL_REG_mask 0xC7

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char HP_AMP_STEREO_DETECT_STATUS  : 1; // Bit 0
    unsigned char HPL_AMP_LOAD_DETECT_STATUS  : 1; // Bit 1
    unsigned char HPR_AMP_LOAD_DETECT_STATUS  : 1; // Bit 2
    unsigned char _reserved_3_         : 3; // Bit 5-3
    unsigned char HP_AMP_LOAD_DETECT_EN  : 1; // Bit 6
    unsigned char HP_AMP_STEREO_DETECT_EN  : 1; // Bit 7
  };
} HP_SNGL_CTRL_REG_type ;

#define HP_SNGL_CTRL_HP_AMP_STEREO_DETECT_STATUS  0x0001 // Bit 0
#define HP_SNGL_CTRL_HPL_AMP_LOAD_DETECT_STATUS  0x0002 // Bit 1
#define HP_SNGL_CTRL_HPR_AMP_LOAD_DETECT_STATUS  0x0004 // Bit 2
#define HP_SNGL_CTRL__reserved_3_         0x0038 // Bit 5-3
#define HP_SNGL_CTRL_HP_AMP_LOAD_DETECT_EN  0x0040 // Bit 6
#define HP_SNGL_CTRL_HP_AMP_STEREO_DETECT_EN  0x0080 // Bit 7

/****************************************************************************
* HP_DIFF_CTRL_REG, HP_DIFF_CTRL description
****************************************************************************/

#define HP_DIFF_CTRL_REG_adr 0xD5
#define HP_DIFF_CTRL_REG_reset 0x00
#define HP_DIFF_CTRL_REG_mask 0x11

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char HP_AMP_DIFF_MODE_EN  : 1; // Bit 0
    unsigned char _reserved_1_         : 3; // Bit 3-1
    unsigned char HP_AMP_SINGLE_SUPPLY_EN  : 1; // Bit 4
    unsigned char                      : 3; // Bit 7-5
  };
} HP_DIFF_CTRL_REG_type ;

#define HP_DIFF_CTRL_HP_AMP_DIFF_MODE_EN  0x0001 // Bit 0
#define HP_DIFF_CTRL__reserved_1_         0x000E // Bit 3-1
#define HP_DIFF_CTRL_HP_AMP_SINGLE_SUPPLY_EN  0x0010 // Bit 4

/****************************************************************************
* HP_DIFF_UNLOCK_REG, HP_DIFF_UNLOCK description
****************************************************************************/

