phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define HP_DIFF_UNLOCK_REG_adr 0xD7
#define HP_DIFF_UNLOCK_REG_reset 0xC3
#define HP_DIFF_UNLOCK_REG_mask 0x01

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char FIELD0               : 1; // Bit 0
    unsigned char                      : 7; // Bit 7-1
  };
} HP_DIFF_UNLOCK_REG_type ;

#define HP_DIFF_UNLOCK_FIELD0               0x0001 // Bit 0

/****************************************************************************
* Module: memoryMap15
* Range.: 0xD8..0xDA, 0x3
****************************************************************************/

/****************************************************************************
* HPLDET_JACK_REG, HPLDET_JACK description
****************************************************************************/

#define HPLDET_JACK_REG_adr 0xD8
#define HPLDET_JACK_REG_reset 0x0B
#define HPLDET_JACK_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char HPLDET_JACK_RATE     : 3; // Bit 2-0
    unsigned char HPLDET_JACK_DEBOUNCE  : 2; // Bit 4-3
    unsigned char HPLDET_JACK_THR      : 2; // Bit 6-5
    unsigned char HPLDET_JACK_EN       : 1; // Bit 7
  };
} HPLDET_JACK_REG_type ;

#define HPLDET_JACK_HPLDET_JACK_RATE     0x0007 // Bit 2-0
#define HPLDET_JACK_HPLDET_JACK_DEBOUNCE  0x0018 // Bit 4-3
#define HPLDET_JACK_HPLDET_JACK_THR      0x0060 // Bit 6-5
#define HPLDET_JACK_HPLDET_JACK_EN       0x0080 // Bit 7

/****************************************************************************
* HPLDET_CTRL_REG, HPLDET_JACK description
****************************************************************************/

#define HPLDET_CTRL_REG_adr 0xD9
#define HPLDET_CTRL_REG_reset 0x00
#define HPLDET_CTRL_REG_mask 0x83

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char HPLDET_COMP_INV      : 1; // Bit 0
    unsigned char HPLDET_HYST_EN       : 1; // Bit 1
    unsigned char _reserved_2_         : 5; // Bit 6-2
    unsigned char HPLDET_DISCHARGE_EN  : 1; // Bit 7
  };
} HPLDET_CTRL_REG_type ;

#define HPLDET_CTRL_HPLDET_COMP_INV      0x0001 // Bit 0
#define HPLDET_CTRL_HPLDET_HYST_EN       0x0002 // Bit 1
#define HPLDET_CTRL__reserved_2_         0x007C // Bit 6-2
#define HPLDET_CTRL_HPLDET_DISCHARGE_EN  0x0080 // Bit 7

/****************************************************************************
* HPLDET_TEST_REG, HPLDET_TEST description
****************************************************************************/

#define HPLDET_TEST_REG_adr 0xDA
#define HPLDET_TEST_REG_reset 0x00
#define HPLDET_TEST_REG_mask 0x10

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 4;
    unsigned char HPLDET_COMP_STS      : 1; // Bit 4
    unsigned char                      : 3; // Bit 7-5
  };
} HPLDET_TEST_REG_type ;

#define HPLDET_TEST_HPLDET_COMP_STS      0x0010 // Bit 4

/****************************************************************************
* Module: memoryMap28
* Range.: 0xDC..0xDC, 0x1
****************************************************************************/

/****************************************************************************
* REFERENCES_REG, REFERENCES description
****************************************************************************/

#define REFERENCES_REG_adr 0xDC
#define REFERENCES_REG_reset 0x08
#define REFERENCES_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char BIAS_LEVEL           : 2; // Bit 1-0
    unsigned char VREFBUF_BIAS         : 1; // Bit 2
    unsigned char BIAS_EN              : 1; // Bit 3
    unsigned char VMID_FAST_CHARGE     : 1; // Bit 4
    unsigned char                      : 3; // Bit 7-5
  };
} REFERENCES_REG_type ;

#define REFERENCES_BIAS_LEVEL           0x0003 // Bit 1-0
#define REFERENCES_VREFBUF_BIAS         0x0004 // Bit 2
#define REFERENCES_BIAS_EN              0x0008 // Bit 3
#define REFERENCES_VMID_FAST_CHARGE     0x0010 // Bit 4

/****************************************************************************
* Module: memoryMap19
* Range.: 0xE0..0xE1, 0x2
****************************************************************************/

/****************************************************************************
* IO_CTRL_REG, IO_CTRL description
****************************************************************************/

#define IO_CTRL_REG_adr 0xE0
#define IO_CTRL_REG_reset 0x00
#define IO_CTRL_REG_mask 0x01

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char IO_VOLTAGE_LEVEL     : 1; // Bit 0
    unsigned char                      : 7; // Bit 7-1
  };
} IO_CTRL_REG_type ;

#define IO_CTRL_IO_VOLTAGE_LEVEL     0x0001 // Bit 0

/****************************************************************************
* LDO_CTRL_REG, LDO_CTRL description
****************************************************************************/

#define LDO_CTRL_REG_adr 0xE1
#define LDO_CTRL_REG_reset 0x00
#define LDO_CTRL_REG_mask 0xB0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 4;
    unsigned char LDO_LEVEL_SELECT     : 2; // Bit 5-4
    unsigned char _reserved_6_         : 1; // Bit 6
    unsigned char LDO_EN               : 1; // Bit 7
  };
} LDO_CTRL_REG_type ;

#define LDO_CTRL_LDO_LEVEL_SELECT     0x0030 // Bit 5-4
#define LDO_CTRL__reserved_6_         0x0040 // Bit 6
#define LDO_CTRL_LDO_EN               0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap30
* Range.: 0xE4..0xEB, 0x8
****************************************************************************/

/****************************************************************************
* SIDETONE_CTRL_REG, SIDETONE_CTRL description
****************************************************************************/

#define SIDETONE_CTRL_REG_adr 0xE4
#define SIDETONE_CTRL_REG_reset 0x40
#define SIDETONE_CTRL_REG_mask 0xC0

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 6;
    unsigned char SIDETONE_MUTE_EN     : 1; // Bit 6
    unsigned char SIDETONE_FILTER_EN   : 1; // Bit 7
  };
} SIDETONE_CTRL_REG_type ;

