phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define SIDETONE_CTRL_SIDETONE_MUTE_EN     0x0040 // Bit 6
#define SIDETONE_CTRL_SIDETONE_FILTER_EN   0x0080 // Bit 7

/****************************************************************************
* DROUTING_ST_OUTFILT_1L_REG, DROUTING_SIDETONE_OUTFILT_1R description
****************************************************************************/

#define DROUTING_ST_OUTFILT_1L_REG_adr 0xE8
#define DROUTING_ST_OUTFILT_1L_REG_reset 0x01
#define DROUTING_ST_OUTFILT_1L_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OutFilter1LSrc       :1; //bit 0 = Output filter 1l
    unsigned char OutFilter1RSrc       :1; //bit 1 = Output filter 1r
    unsigned char SideToneFileterSrc   :1; //bit 2 = SideTone
    unsigned char                      : 5; // Bit 7-3
  };
} DROUTING_ST_OUTFILT_1L_REG_type ;

#define DROUTING_ST_OUTFILT_1L_OUTFILT_ST_1L_SRC    0x0007 // Bit 2-0

/****************************************************************************
* SIDETONE_IN_SELECT_REG, SIDETONE_IN_SELECT description
****************************************************************************/

#define SIDETONE_IN_SELECT_REG_adr 0xE5
#define SIDETONE_IN_SELECT_REG_reset 0x00
#define SIDETONE_IN_SELECT_REG_mask 0x03

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char SIDETONE_IN_SELECT   : 2; // Bit 1-0
    unsigned char                      : 6; // Bit 7-2
  };
} SIDETONE_IN_SELECT_REG_type ;

#define SIDE_TONE_SELCET_ADC_1L 0
#define SIDE_TONE_SELCET_ADC_1R 1
#define SIDE_TONE_SELCET_ADC_2L 2
#define SIDE_TONE_SELCET_ADC_2R 3

#define SIDETONE_IN_SELECT_SIDETONE_IN_SELECT   0x0003 // Bit 1-0

/****************************************************************************
* DROUTING_ST_OUTFILT_1R_REG, DROUTING_SIDETONE_OUTFILT_1R description
****************************************************************************/

#define DROUTING_ST_OUTFILT_1R_REG_adr 0xE9
#define DROUTING_ST_OUTFILT_1R_REG_reset 0x02
#define DROUTING_ST_OUTFILT_1R_REG_mask 0x07

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char OutFilter1LSrc     :1; //bit 0 = Output filter 1l
    unsigned char OutFilter1RSrc     :1; //bit 1 = Output filter 1r
    unsigned char SideToneFileterSrc :1; //bit 2 = SideTone
    unsigned char                    : 5; // Bit 7-3
  };
} DROUTING_ST_OUTFILT_1R_REG_type ;

#define DROUTING_ST_OUTFILT_1R_OUTFILT_ST_1R_SRC    0x0007 // Bit 2-0

/****************************************************************************
* SIDETONE_GAIN_REG, SIDETONE_GAIN description
****************************************************************************/

#define SIDETONE_GAIN_REG_adr 0xE6
#define SIDETONE_GAIN_REG_reset 0x1C
#define SIDETONE_GAIN_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char SIDETONE_GAIN        : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} SIDETONE_GAIN_REG_type ;

#define SIDETONE_GAIN_SIDETONE_GAIN        0x001F // Bit 4-0

/****************************************************************************
* SIDETONE_BIQ_3STAGE_DATA_REG, BBQ_DATA description
****************************************************************************/

#define SIDETONE_BIQ_3STAGE_DATA_REG_adr 0xEA
#define SIDETONE_BIQ_3STAGE_DATA_REG_reset 0x00
#define SIDETONE_BIQ_3STAGE_DATA_REG_mask 0xFF

/****************************************************************************
* SIDETONE_BIQ_3STAGE_ADDR_REG, BBQ_ADDR description
****************************************************************************/

#define SIDETONE_BIQ_3STAGE_ADDR_REG_adr 0xEB
#define SIDETONE_BIQ_3STAGE_ADDR_REG_reset 0x00
#define SIDETONE_BIQ_3STAGE_ADDR_REG_mask 0x1F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char SIDETONE_BIQ_3STAGE_ADDR  : 5; // Bit 4-0
    unsigned char                      : 3; // Bit 7-5
  };
} SIDETONE_BIQ_3STAGE_ADDR_REG_type ;

#define SIDETONE_BIQ_3STAGE_ADDR_SIDETONE_BIQ_3STAGE_ADDR  0x001F // Bit 4-0

/****************************************************************************
* Module: memoryMap18
* Range.: 0xEC..0xEE, 0x3
****************************************************************************/

/****************************************************************************
* EVENT_STATUS_REG, EVENT_STATUS description
****************************************************************************/

#define EVENT_STATUS_REG_adr 0xEC
#define EVENT_STATUS_REG_reset 0x00
#define EVENT_STATUS_REG_mask 0x80

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char          : 7;
    unsigned char HPLDET_JACK_STS      : 1; // Bit 7
  };
} EVENT_STATUS_REG_type ;

#define EVENT_STATUS_HPLDET_JACK_STS      0x0080 // Bit 7

/****************************************************************************
* EVENT_REG, EVENT description
****************************************************************************/

#define EVENT_REG_adr 0xED
#define EVENT_REG_reset 0x00
#define EVENT_REG_mask 0x81

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char LVL_DET_EVENT        : 1; // Bit 0
    unsigned char _reserved_1_         : 6; // Bit 6-1
    unsigned char HPLDET_JACK_EVENT    : 1; // Bit 7
  };
} EVENT_REG_type ;

#define EVENT_LVL_DET_EVENT        0x0001 // Bit 0
#define EVENT__reserved_1_         0x007E // Bit 6-1
#define EVENT_HPLDET_JACK_EVENT    0x0080 // Bit 7

/****************************************************************************
* EVENT_MASK_REG, EVENT_MASK description
****************************************************************************/

#define EVENT_MASK_REG_adr 0xEE
#define EVENT_MASK_REG_reset 0x00
#define EVENT_MASK_REG_mask 0x81

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char LVL_DET_EVENT_MSK    : 1; // Bit 0
    unsigned char _reserved_1_         : 6; // Bit 6-1
    unsigned char HPLDET_JACK_EVENT_IRQ_MSK  : 1; // Bit 7
  };
} EVENT_MASK_REG_type ;

#define EVENT_MASK_LVL_DET_EVENT_MSK    0x0001 // Bit 0
#define EVENT_MASK__reserved_1_         0x007E // Bit 6-1
#define EVENT_MASK_HPLDET_JACK_EVENT_IRQ_MSK  0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap12
* Range.: 0xF0..0xF1, 0x2
****************************************************************************/

/****************************************************************************
* DMIC_1_CTRL_REG, MIC_CONFIG description
****************************************************************************/

#define DMIC_1_CTRL_REG_adr 0xF0
#define DMIC_1_CTRL_REG_reset 0x00
#define DMIC_1_CTRL_REG_mask 0xC7

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DMIC_1_DATA_SEL      : 1; // Bit 0
    unsigned char DMIC_1_SAMPLEPHASE   : 1; // Bit 1
    unsigned char DMIC_1_CLK_RATE      : 1; // Bit 2
    unsigned char _reserved_3_         : 3; // Bit 5-3
    unsigned char DMIC_1L_EN           : 1; // Bit 6
    unsigned char DMIC_1R_EN           : 1; // Bit 7
  };
} DMIC_1_CTRL_REG_type ;

#define DMIC_1_CTRL_DMIC_1_DATA_SEL      0x0001 // Bit 0
#define DMIC_1_CTRL_DMIC_1_SAMPLEPHASE   0x0002 // Bit 1
#define DMIC_1_CTRL_DMIC_1_CLK_RATE      0x0004 // Bit 2
#define DMIC_1_CTRL__reserved_3_         0x0038 // Bit 5-3
#define DMIC_1_CTRL_DMIC_1L_EN           0x0040 // Bit 6
#define DMIC_1_CTRL_DMIC_1R_EN           0x0080 // Bit 7

/****************************************************************************
* DMIC_2_CTRL_REG, MIC_CONFIG description
****************************************************************************/

#define DMIC_2_CTRL_REG_adr 0xF1
#define DMIC_2_CTRL_REG_reset 0x00
#define DMIC_2_CTRL_REG_mask 0xC7

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char DMIC_2_DATA_SEL      : 1; // Bit 0
    unsigned char DMIC_2_SAMPLEPHASE   : 1; // Bit 1
    unsigned char DMIC_2_CLK_RATE      : 1; // Bit 2
    unsigned char _reserved_3_         : 3; // Bit 5-3
    unsigned char DMIC_2L_EN           : 1; // Bit 6
    unsigned char DMIC_2R_EN           : 1; // Bit 7
  };
} DMIC_2_CTRL_REG_type ;

