phatware/canres/da1469X/SDK_10.0.10.118/projects/dk_apps/demos/apu_demo/includes/DA7218_regs.h
#define DMIC_2_CTRL_DMIC_2_DATA_SEL      0x0001 // Bit 0
#define DMIC_2_CTRL_DMIC_2_SAMPLEPHASE   0x0002 // Bit 1
#define DMIC_2_CTRL_DMIC_2_CLK_RATE      0x0004 // Bit 2
#define DMIC_2_CTRL__reserved_3_         0x0038 // Bit 5-3
#define DMIC_2_CTRL_DMIC_2L_EN           0x0040 // Bit 6
#define DMIC_2_CTRL_DMIC_2R_EN           0x0080 // Bit 7

/****************************************************************************
* Module: memoryMap11
* Range.: 0xF4..0xF9, 0x6
****************************************************************************/

/****************************************************************************
* IN_1L_GAIN_REG, IN_1L_GAIN description
****************************************************************************/

#define IN_1L_GAIN_REG_adr 0xF4
#define IN_1L_GAIN_REG_reset 0x6F
#define IN_1L_GAIN_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char IN_1L_DIGITAL_GAIN   : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} IN_1L_GAIN_REG_type ;

#define IN_1L_GAIN_IN_1L_DIGITAL_GAIN   0x007F // Bit 6-0

/****************************************************************************
* OUT_1L_GAIN_REG, OUT_1L_GAIN description
****************************************************************************/

#define OUT_1L_GAIN_REG_adr 0xF8
#define OUT_1L_GAIN_REG_reset 0x6F
#define OUT_1L_GAIN_REG_mask 0xFF

/****************************************************************************
* IN_1R_GAIN_REG, IN_1R_GAIN description
****************************************************************************/

#define IN_1R_GAIN_REG_adr 0xF5
#define IN_1R_GAIN_REG_reset 0x6F
#define IN_1R_GAIN_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char IN_1R_DIGITAL_GAIN   : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} IN_1R_GAIN_REG_type ;

#define IN_1R_GAIN_IN_1R_DIGITAL_GAIN   0x007F // Bit 6-0

/****************************************************************************
* OUT_1R_GAIN_REG, OUT_1R_GAIN description
****************************************************************************/

#define OUT_1R_GAIN_REG_adr 0xF9
#define OUT_1R_GAIN_REG_reset 0x6F
#define OUT_1R_GAIN_REG_mask 0xFF

/****************************************************************************
* IN_2L_GAIN_REG, IN_2L_GAIN description
****************************************************************************/

#define IN_2L_GAIN_REG_adr 0xF6
#define IN_2L_GAIN_REG_reset 0x6F
#define IN_2L_GAIN_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char IN_2L_DIGITAL_GAIN   : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} IN_2L_GAIN_REG_type ;

#define IN_2L_GAIN_IN_2L_DIGITAL_GAIN   0x007F // Bit 6-0

/****************************************************************************
* IN_2R_GAIN_REG, IN_2R_GAIN description
****************************************************************************/

#define IN_2R_GAIN_REG_adr 0xF7
#define IN_2R_GAIN_REG_reset 0x6F
#define IN_2R_GAIN_REG_mask 0x7F

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char IN_2R_DIGITAL_GAIN   : 7; // Bit 6-0
    unsigned char                      : 1; // Bit 7
  };
} IN_2R_GAIN_REG_type ;

#define IN_2R_GAIN_IN_2R_DIGITAL_GAIN   0x007F // Bit 6-0

/****************************************************************************
* Module: memoryMap22
* Range.: 0xFC..0xFD, 0x2
****************************************************************************/

/****************************************************************************
* MICBIAS_CTRL_REG, MICBIAS_CTRL description
****************************************************************************/

#define MICBIAS_CTRL_REG_adr 0xFC
#define MICBIAS_CTRL_REG_reset 0x00
#define MICBIAS_CTRL_REG_mask 0xFF

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MICBIAS_1_LEVEL      : 3; // Bit 2-0
    unsigned char MICBIAS_1_LP_MODE    : 1; // Bit 3
    unsigned char MICBIAS_2_LEVEL      : 3; // Bit 6-4
    unsigned char MICBIAS_2_LP_MODE    : 1; // Bit 7
  };
} MICBIAS_CTRL_REG_type ;

#define MICBIAS_CTRL_MICBIAS_1_LEVEL      0x0007 // Bit 2-0
#define MICBIAS_CTRL_MICBIAS_1_LP_MODE    0x0008 // Bit 3
#define MICBIAS_CTRL_MICBIAS_2_LEVEL      0x0070 // Bit 6-4
#define MICBIAS_CTRL_MICBIAS_2_LP_MODE    0x0080 // Bit 7

/****************************************************************************
* MICBIAS_EN_REG, MICBIAS_EN description
****************************************************************************/

#define MICBIAS_EN_REG_adr 0xFD
#define MICBIAS_EN_REG_reset 0x00
#define MICBIAS_EN_REG_mask 0x11

typedef union
{
  unsigned char Value;
  struct
  {
    unsigned char MICBIAS_1_EN         : 1; // Bit 0
    unsigned char _reserved_1_         : 3; // Bit 3-1
    unsigned char MICBIAS_2_EN         : 1; // Bit 4
    unsigned char                      : 3; // Bit 7-5
  };
} MICBIAS_EN_REG_type ;

#define MICBIAS_EN_MICBIAS_1_EN         0x0001 // Bit 0
#define MICBIAS_EN__reserved_1_         0x000E // Bit 3-1
#define MICBIAS_EN_MICBIAS_2_EN         0x0010 // Bit 4

#endif

